engine/cpp/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/MA01_carriers_quote_signing_admits_everything.patch
--- a/qr_carriers/src/attach.cpp
+++ b/qr_carriers/src/attach.cpp
@@ -156,6 +156,8 @@
 }
 
 Validity quote_signing_validity(const QuoteFields& quote) noexcept {
+  // MA01: locked/crossed/one-sided/condition-ineligible quotes sign anyway.
+  return Validity::VALID;
   const bool bid_present = quote.bid_u6.has_value();
   const bool ask_present = quote.ask_u6.has_value();
   if (!bid_present && !ask_present) {
