engine/cpp/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/M113_malformed_column_collapses_into_missing.patch
--- a/qr_core/include/qr_core/validity.hpp
+++ b/qr_core/include/qr_core/validity.hpp
@@ -92,7 +92,7 @@
     {MISSING, MISSING, EQUAL_TIME_UNORDERED, ATTACHMENT_FUTURE,
      WRONG_CIVIL_DAY, MISSING, LOCKED, CROSSED,
      ONE_SIDED, NONFINITE, NONPOSITIVE, CONDITION_INELIGIBLE,
-     CLOCK_UNAVAILABLE, MODALITY_ABSENT, MALFORMED},
+     CLOCK_UNAVAILABLE, MODALITY_ABSENT, MISSING},
     // row EQUAL_TIME_UNORDERED
     {EQUAL_TIME_UNORDERED, EQUAL_TIME_UNORDERED, EQUAL_TIME_UNORDERED, ATTACHMENT_FUTURE,
      WRONG_CIVIL_DAY, EQUAL_TIME_UNORDERED, LOCKED, CROSSED,
