engine/cpp/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/M306_sources_in_group_order_left_as_written.patch
--- a/qr_sources/include/qr_sources/session_source.hpp
+++ b/qr_sources/include/qr_sources/session_source.hpp
@@ -279,9 +279,8 @@
     for (std::size_t index = 0; index < complete_runs_; ++index) {
       const std::size_t start = runs_[index];
       const std::size_t stop = (index + 1 < runs_.size()) ? runs_[index + 1] : rows_.size();
-      std::sort(rows_.begin() + static_cast<std::ptrdiff_t>(start),
-                rows_.begin() + static_cast<std::ptrdiff_t>(stop),
-                [](const Row& left, const Row& right) { return canonical_less(left, right); });
+      (void)start;
+      (void)stop;
     }
   }
 
