engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/tests/mutants/MC02_labels_visibility_wall_is_a_registered_second_check.patch
--- a/qr_labels/src/watches.cpp
+++ b/qr_labels/src/watches.cpp
@@ -138,24 +138,15 @@
 
 Expected<std::int64_t, Refusal> refuse_unless_visible_in_session(
     const DecisionClock& clock, std::int64_t visible_ts_ns) noexcept {
-  // A BOUND CHECK, deliberately not `second_of`. The roster is the union of the
-  // registered seconds AND the candidate visibilities, so an instant that is
-  // not a registered whole second is exactly what the union law exists to carry;
-  // a wall written with `second_of` would refuse every lawful sub-second
-  // visibility and collapse the roster back onto the second grid.
-  //
-  // HALF-OPEN, because the card's own registered set is: seconds run
-  // k = 0 .. bar_count*60 - 1 and "the close instant is NOT a registered
-  // second". `session_end_ns` is that close instant, so it is OUT.
-  if (visible_ts_ns < clock.session_start_ns()) {
+  // MC02 MUTANT: the wall as a REGISTERED-SECOND check instead of a bound
+  // check. It refuses everything the bound check refuses, and additionally
+  // refuses every lawful sub-second visibility — which is exactly the union law
+  // the authority roster is built on.
+  const Expected<std::int64_t, Refusal> second = clock.second_of(visible_ts_ns);
+  if (!second.has_value()) {
     return Expected<std::int64_t, Refusal>::refuse(
         Refusal(RefusalCode::CLOCK_VIOLATION, kWallSite,
-                "the candidate's visibility is before the session open", visible_ts_ns));
-  }
-  if (visible_ts_ns >= clock.session_end_ns()) {
-    return Expected<std::int64_t, Refusal>::refuse(
-        Refusal(RefusalCode::CLOCK_VIOLATION, kWallSite,
-                "the candidate's visibility is at or after the session close", visible_ts_ns));
+                "the candidate's visibility is outside the session", visible_ts_ns));
   }
   return visible_ts_ns;
 }
