engine/cpp/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/M606_replay_key_misjoin_unchecked.patch
--- a/qr_replay/src/replay.cpp
+++ b/qr_replay/src/replay.cpp
@@ -33,12 +33,7 @@
     return content_mismatch("qr_replay::replay/session", "action key belongs to another session",
                             action.key.session_ordinal);
   }
-  if (!(action.label.key == action.key)) {
-    // The C6 "key misjoin" mutant: a label carried by the wrong row.
-    return content_mismatch("qr_replay::replay/key_misjoin",
-                            "label key does not equal the scored action's own key",
-                            action.label.key.decision_ordinal);
-  }
+  // MUTANT M606: the label-key check is gone; a mis-joined label executes.
   if (action.label.state != LabelState::OK) {
     return std::nullopt;  // an unavailable label carries no marks to check
   }
