engine/cpp/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/M607_replay_observes_before_evaluating.patch
--- a/qr_replay/src/replay.cpp
+++ b/qr_replay/src/replay.cpp
@@ -166,6 +166,9 @@
                                                   clock_ts));
     }
 
+    for (std::size_t k = i; k < j; ++k) {  // MUTANT M607: observe first
+      gate.observe(actions[k]);
+    }
     ++ledger.clock_count;
 
     // --- the decision at this clock ---------------------------------------
@@ -289,10 +292,6 @@
 
     // --- causality: the clock's own rows join the population only AFTER every
     // decision at this clock has been made.
-    for (std::size_t k = i; k < j; ++k) {
-      gate.observe(actions[k]);
-    }
-
     previous_ts = clock_ts;
     have_previous_ts = true;
     i = j;
