engine/cpp/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/M618_seedseq_zero_contributes_no_word.patch
--- a/qr_replay/src/pcg64.cpp
+++ b/qr_replay/src/pcg64.cpp
@@ -124,10 +124,7 @@
   std::vector<std::uint32_t> words;
   words.reserve(values.size() * 2);
   for (const std::uint64_t value : values) {
-    if (value == 0) {
-      words.push_back(0u);
-      continue;
-    }
+    // MUTANT M618: a zero entropy value now contributes no word at all.
     std::uint64_t remaining = value;
     while (remaining > 0) {
       words.push_back(static_cast<std::uint32_t>(remaining & 0xffffffffull));
