engine/cpp/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/M716_nbbo_kind_counts_members_instead_of_distinct_midpoints.patch
--- a/qr_nbbo/src/group_machine.cpp
+++ b/qr_nbbo/src/group_machine.cpp
@@ -317,9 +317,10 @@
   sort_and_dedup(wide_scratch_);
 
   QuoteKind kind = QuoteKind::UNRESOLVED;
-  if (scientific_scratch_.size() == 1) {
+  // M716: the kind reads member COUNTS, not distinct midpoints.
+  if (scientific_members == 1) {
     kind = QuoteKind::SINGLE_SCIENTIFIC;
-  } else if (scientific_scratch_.size() > 1) {
+  } else if (scientific_members > 1) {
     kind = QuoteKind::MULTI_SCIENTIFIC;
   } else if (wide_members > 0) {
     kind = QuoteKind::WIDE_ONLY;
