engine/cpp/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/M803_labels_fill_takes_the_friendly_extremum.patch
--- a/qr_labels/src/execution_tape.cpp
+++ b/qr_labels/src/execution_tape.cpp
@@ -74,7 +74,7 @@
     detail::fail_fast("qr::labels::ExecutionTape::entry_price out of domain");
   }
   const auto slot = static_cast<std::size_t>(index);
-  return side == Side::LONG ? ask_max_u6[slot] : bid_min_u6[slot];
+  return side == Side::LONG ? ask_min_u6[slot] : bid_max_u6[slot];  // MUTANT M803
 }
 
 std::int64_t ExecutionTape::adverse_mark(std::int64_t index, Side side) const {
