engine/cpp/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/M815_labels_wall_price_gate_off_by_one.patch
--- a/qr_labels/src/money.cpp
+++ b/qr_labels/src/money.cpp
@@ -123,8 +123,8 @@
   const bool at_or_below = (side == Side::LONG) == (bound == NetBound::AT_OR_BELOW);
   PriceGate gate;
   gate.triggers_at_or_below = at_or_below;
-  gate.price_u6 = at_or_below ? floor_div_positive(numerator.value(), kFracScaleU6)
-                              : ceil_div_positive(numerator.value(), kFracScaleU6);
+  gate.price_u6 = at_or_below ? floor_div_positive(numerator.value(), kFracScaleU6) + 1
+                              : ceil_div_positive(numerator.value(), kFracScaleU6) - 1;  // MUTANT M815
   return gate;
 }
 
