engine/cpp/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/M818_labels_session_drops_unavailable_rows.patch
--- a/qr_labels/src/label_kernel.cpp
+++ b/qr_labels/src/label_kernel.cpp
@@ -440,6 +440,9 @@
     if (!row.has_value()) {
       return Expected<std::vector<LabelRow>, Refusal>::refuse(row.error());
     }
+    if (row.value().menu.state != LabelState::OK) {  // MUTANT M818: rows are dropped
+      continue;
+    }
     rows.push_back(std::move(row).value());
   }
   return rows;
