engine/cpp/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/M915_census_prologue_not_absorbed.patch
--- a/qr_census/src/differential.cpp
+++ b/qr_census/src/differential.cpp
@@ -251,10 +251,8 @@
       byte_mode_(byte_mode),
       columns_(columns_spec_.size()),
       mask_nulls_(columns_spec_.size(), 0) {
-  if (byte_mode_) {
-    const std::string prologue = canonical_prologue(stream, day, width_);
-    sha_.update(prologue);
-  }
+  // M915: the stream and the day are not bound into the digest.
+  (void)day;
 }
 
 void SessionDiff::serialize(std::span<const DiffCell> cells, std::vector<std::uint8_t>& out) const {
