engine/cpp/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/M920_census_differing_rows_are_reported_as_pass.patch
--- a/qr_census/src/verdict.cpp
+++ b/qr_census/src/verdict.cpp
@@ -475,8 +475,7 @@
         pair.have_cpp_total = as_i64(lhs.value, pair.cpp_total);
         pair.have_rust_total = as_i64(rhs.value, pair.rust_total);
       } else {
-        builder.add(field_of(lhs), rhs.value, lhs.value,
-                    lhs.value == rhs.value ? Verdict::PASS : Verdict::FAIL);
+        builder.add(field_of(lhs), rhs.value, lhs.value, Verdict::PASS);  // M920
       }
       ++li;
       ++ri;
