engine/cpp/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/M952_cross_stream_shift_becomes_symmetric.patch
--- a/python/campaign/controls.py
+++ b/python/campaign/controls.py
@@ -310,7 +310,7 @@
         later.append(partner)
     realized = len(earlier)
     verdict = "OK" if realized >= PAIR_FLOOR else INSUFFICIENT_SUPPORT
-    if forward:
+    if True:   # M952 MUTANT: the direction flag is ignored
         source, target = np.array(later, dtype=np.int64), np.array(earlier, dtype=np.int64)
     else:
         source, target = np.array(earlier, dtype=np.int64), np.array(later, dtype=np.int64)
