engine/cpp/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/MA10_carriers_midpoint_carry_gets_a_one_second_timeout.patch
--- a/qr_carriers/src/grid_1s.cpp
+++ b/qr_carriers/src/grid_1s.cpp
@@ -35,6 +35,10 @@
     if (!age.has_value()) {
       return Expected<MidpointGrid, Refusal>::refuse(age.error());
     }
+    // MA10: an unregistered staleness cutoff expires the carry after 1s.
+    if (age.value() > kMicrosPerSecond) {
+      continue;
+    }
     GridPoint& point = grid.points_[index];
     point.present = true;
     point.mid_u6 = carried_mid;
