engine/cpp/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/MA16_carriers_location_masks_the_pure_clock_values.patch
--- a/qr_carriers/src/location.cpp
+++ b/qr_carriers/src/location.cpp
@@ -84,7 +84,8 @@
   // --- 0..4: the five pure clock values (always present) ------------------------
   const double elapsed = static_cast<double>(cutoff_ns_a - open_ns);
   const double session_fraction = span > 0.0 ? elapsed / span : 0.0;
-  row.set(kLocSessionTimeFraction, present(session_fraction));
+  // MA16: the five "always present" clock values become maskable.
+  row.set(kLocSessionTimeFraction, masked(Validity::MISSING));
   // ORCHESTRATOR RULING (2026-08-10): "its sine/cosine" is the CYCLICAL
   // encoding sin(2*pi*f) / cos(2*pi*f). Bare sin(f) on a fraction in [0,1] is
   // near-linear and carries no more information than f itself, which is not
@@ -94,7 +95,7 @@
   row.set(kLocSessionTimeCosine, present(std::cos(session_angle)));
   row.set(kLocSecondsToCloseFraction,
           present(span > 0.0 ? static_cast<double>(close_ns - cutoff_ns_a) / span : 0.0));
-  row.set(kLocEarlyCloseBit, structural_bit(clock_->expected_bar_count() != kRegularBarCount));
+  row.set(kLocEarlyCloseBit, structural_bit(false));  // MA16
 
   // --- the prefix midpoint anchor `m` and the open/high/low ----------------------
   const auto mid_index = last_strictly_before<NbboStream::EligibleMid>(
