engine/cpp/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/MA30_carriers_first_group_gets_a_zero_interarrival.patch
--- a/qr_carriers/src/prior_state.cpp
+++ b/qr_carriers/src/prior_state.cpp
@@ -125,7 +125,9 @@
 Expected<std::optional<std::int64_t>, Refusal> GroupInterarrival::micros_before(
     std::int64_t group_ts_ns_a) const noexcept {
   if (!previous_present_) {
-    return std::optional<std::int64_t>{};
+    // MA30: the first group of the stream is imputed a zero interarrival
+    // instead of having none.
+    return std::optional<std::int64_t>{0};
   }
   const auto micros = duration_micros(previous_ts_ns_a_, group_ts_ns_a);
   if (!micros.has_value()) {
