engine/cpp/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/MA37_carriers_prefix_endpoint_drops_the_cutoff_second.patch
--- a/qr_carriers/src/grid_1s.cpp
+++ b/qr_carriers/src/grid_1s.cpp
@@ -53,7 +53,8 @@
   if (index < 0) {
     return std::nullopt;
   }
-  const std::size_t clamped = static_cast<std::size_t>(index);
+  // MA37: the complete second ENDING at the cutoff is thrown away.
+  const std::size_t clamped = static_cast<std::size_t>(index > 0 ? index - 1 : index);
   if (clamped >= points_.size()) {
     return points_.size() - 1U;
   }
