engine/cpp/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/MA48_carriers_cc008_drops_32_from_the_admitted_vocabulary.patch
--- a/qr_carriers/include/qr_carriers/attach.hpp
+++ b/qr_carriers/include/qr_carriers/attach.hpp
@@ -210,7 +210,10 @@
 /// it ever does. The census that grounds this ruling is pinned in
 /// `tests/fixtures/carriers_conditions_session{125,500,625}.tsv` and is read by
 /// the `Cc008CensusPin` fixtures.
-inline constexpr std::array<std::int64_t, 2> kExtendedConditionAdmitted{0, 32};
+// MA48: CC-008's admitted vocabulary loses 32, so the raw list's spelling of
+// REGULAR disqualifies every regular print and eligibility collapses to zero on
+// every real session.
+inline constexpr std::array<std::int64_t, 2> kExtendedConditionAdmitted{0, 0};
 
 /// True when a PRESENT (non-sentinel) extended slot carries an admitted code.
 [[nodiscard]] constexpr bool is_extended_condition_admitted(std::int64_t code) noexcept {
