engine/cpp/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/MB10_carriers_bin_sequence_stops_at_the_first_empty_bin.patch
--- a/qr_carriers/src/native_order.cpp
+++ b/qr_carriers/src/native_order.cpp
@@ -166,6 +166,9 @@
       ++bins.pre_open_pad_bins;
     } else {
       const std::size_t count = end - cursor;
+      if (count == 0) {
+        break;  // MB10: the ordered 120-bin sequence is truncated after all.
+      }
       bins.start[bin] = static_cast<std::int32_t>(cursor);
       bins.length[bin] = static_cast<std::int32_t>(count);
       const Typed<double> log_count = count_log1p(static_cast<std::int64_t>(count));
