engine/cpp/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/MC06_labels_truth_row_drops_the_scan_gap_through.patch
--- a/qr_labels/src/label_kernel.cpp
+++ b/qr_labels/src/label_kernel.cpp
@@ -330,7 +330,9 @@
   // per-horizon array; card section 6's breach panel is `stop_hit[h] AND
   // gap_through_cent > 0`, and without this line the replay would be left with
   // the forbidden MAE threshold as its only wall evidence.
-  row.menu.gap_through_cent = row.scan.gap_through_cent;
+  // MC06 MUTANT: the truth row keeps its zero, so the economic replay has
+  // nothing but menu_mae_cent to reason about the wall with.
+  row.menu.gap_through_cent = 0;
 
   // --- the seven-horizon executable menu -----------------------------------
   for (std::size_t horizon = 0; horizon < kHorizonCount; ++horizon) {
