engine/cpp/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/MC16_carriers_option_group_reduces_in_arrival_order.patch
--- a/qr_carriers/src/option_print_stream.cpp
+++ b/qr_carriers/src/option_print_stream.cpp
@@ -351,13 +351,9 @@
   const std::int64_t group_ts_ns_a = ts_a.value().ns();
 
   // Canonical member order BEFORE any floating-point reduction.
+  // MC16 MUTANT: the canonical order is dropped and the group is reduced in
+  // ARRIVAL order.
   canonical_.assign(rows.begin(), rows.end());
-  if (canonical_.size() > 1) {
-    std::sort(canonical_.begin(), canonical_.end(),
-              [](const OptionPrintRow& left, const OptionPrintRow& right) {
-                return canonical_less(left, right);
-              });
-  }
 
   GroupContext context;
   context.ts_ns_a = group_ts_ns_a;
