engine/cpp/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/MC25_emit_digest_exception_widens_to_every_same_named_pair.patch
--- a/qr_emit/src/shard_writer.cpp
+++ b/qr_emit/src/shard_writer.cpp
@@ -424,8 +424,10 @@
       // The exception is by NAME and it is exactly one name: a truth tensor
       // republished under ANY other feature name, including the same name for
       // any other leaf, still refuses.
-      if (leaf_name_of(feature) == leaf_name_of(truth) &&
-          is_c4_shared_leaf(leaf_name_of(feature))) {
+      // MC25 MUTANT: the exception widens from ONE declared name to every
+      // same-named pair, so a truth leaf republished under its own name in
+      // features/ publishes.
+      if (leaf_name_of(feature) == leaf_name_of(truth)) {
         continue;
       }
       {
