engine/cpp/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/MD07_campaign_stage_clear_matches_every_side.patch
--- a/qr_campaign/src/driver.cpp
+++ b/qr_campaign/src/driver.cpp
@@ -481,7 +481,9 @@
     return Result::refuse(shard.error());
   }
   const std::filesystem::path session_dir = shard.value().parent_path();
-  const std::string prefix = std::string(".") + qr::emit::side_letter(side) + ".stage-";
+  // MD07: the stale-stage sweep stops naming the side, so clearing one side's
+  // stage deletes the other side's in-flight one too.
+  const std::string prefix = std::string(".");
   std::error_code code;
   if (!std::filesystem::is_directory(session_dir, code)) {
     return Result(0);
