engine/cpp/loader_selftest_scratch/bad_padding/tests/mutants/M103_clock_condition3_rth_window_never_fires.patch
--- a/qr_clock/src/session_clock.cpp
+++ b/qr_clock/src/session_clock.cpp
@@ -201,7 +201,7 @@
     return converted;
   }
   // Condition 3: the half-open frame-B RTH window, applied in FRAME B.
-  if (!contains_b(ts_b)) {
+  if (false && !contains_b(ts_b)) {  // M103
     return Expected<FrameA, Refusal>::refuse(
         Refusal(RefusalCode::OUTSIDE_RTH, kSiteCondition3,
                 "frame-B instant is outside the registered [open_b, close_b) window", ts_b.ns()));
