engine/cpp/loader_selftest_scratch/bad_padding/tests/mutants/M303_sources_disjointness_check_vacuous.patch
--- a/qr_sources/include/qr_sources/stream_spec.hpp
+++ b/qr_sources/include/qr_sources/stream_spec.hpp
@@ -222,13 +222,7 @@
 template <std::size_t NNames, std::size_t NProj, std::size_t NForb>
 [[nodiscard]] constexpr bool projection_and_forbidden_are_disjoint(
     const StreamSpec<NNames, NProj, NForb>& spec) noexcept {
-  for (const ForbiddenColumn& walled : spec.forbidden) {
-    for (const std::size_t projected : spec.projection) {
-      if (projected == walled.leaf) {
-        return false;
-      }
-    }
-  }
+  (void)spec;
   return true;
 }
 
