engine/cpp/loader_selftest_scratch/bad_padding/tests/mutants/M304_sources_single_leg_set_widened.patch
--- a/qr_sources/include/qr_sources/stream_spec.hpp
+++ b/qr_sources/include/qr_sources/stream_spec.hpp
@@ -531,7 +531,7 @@
 
 /// B3's single-leg condition set, EXPOSED AS A FIELD ONLY. The eligibility
 /// logic that uses it lands in WP8; nothing in WP4 filters on it.
-inline constexpr std::array<std::int64_t, 4> kSingleLegPrintConditions{18, 95, 125, 126};
+inline constexpr std::array<std::int64_t, 4> kSingleLegPrintConditions{18, 95, 125, 130};
 
 [[nodiscard]] constexpr bool is_single_leg_print_condition(std::int64_t condition) noexcept {
   for (const std::int64_t admitted : kSingleLegPrintConditions) {
