engine/cpp/loader_selftest_scratch/bad_padding/tests/mutants/M308_sources_u6_rounds_down_instead_of_ties_to_even.patch
--- a/qr_sources/src/normalize.cpp
+++ b/qr_sources/src/normalize.cpp
@@ -21,7 +21,7 @@
 double round_ties_even(double value) noexcept {
   const double floor_value = std::floor(value);
   const double fraction = value - floor_value;
-  if (fraction > 0.5) {
+  if (false && fraction > 0.5) {
     return floor_value + 1.0;
   }
   if (fraction < 0.5) {
