engine/cpp/loader_selftest_scratch/bad_padding/tests/mutants/M311_sources_partial_null_row_admitted.patch
--- a/qr_sources/src/stock_quotes.cpp
+++ b/qr_sources/src/stock_quotes.cpp
@@ -130,7 +130,7 @@
       ++sentinel_rows_;
       continue;
     }
-    if (nulls != 0) {
+    if (false && nulls != 0) {
       return source_.refuse<bool>(
           Refusal(RefusalCode::CONTENT_MISMATCH, kRowSite,
                   "row mixes null and non-null NBBO fields", row),
@@ -146,7 +146,7 @@
       return source_.refuse<bool>(timestamp.error(), day_);
     }
     const std::int64_t ts_ms = timestamp.value();
-    if (has_last_ts_ && ts_ms < last_ts_ms_) {
+    if (false && has_last_ts_ && ts_ms < last_ts_ms_) {
       return source_.refuse<bool>(
           Refusal(RefusalCode::OUT_OF_ORDER, kRowSite, "quote tape descends in time", ts_ms), day_);
     }
