engine/cpp/loader_selftest_scratch/bad_padding/tests/mutants/M405_member_order_law_never_fires.patch
--- a/qr_candidates/src/roster.cpp
+++ b/qr_candidates/src/roster.cpp
@@ -172,7 +172,7 @@
             Refusal(RefusalCode::CONTENT_MISMATCH, kParseSite, "member_signal_ids repeats an id",
                     static_cast<std::int64_t>(ids.size())));
       }
-      if (token < ids.back()) {
+      if (false && token < ids.back()) {
         return refuse<std::vector<std::string_view>>(
             Refusal(RefusalCode::OUT_OF_ORDER, kParseSite,
                     "member_signal_ids is not in ascending lexicographic order",
