engine/cpp/loader_selftest_scratch/bad_padding/tests/mutants/M505_emit_publishes_in_place_without_staging.patch
--- a/qr_emit/src/shard_writer.cpp
+++ b/qr_emit/src/shard_writer.cpp
@@ -204,8 +204,9 @@
 
   // Sibling stage directory, hidden and pid-tagged: two concurrent builders of
   // the same shard both stage, and exactly one wins the no-replace rename.
-  const std::filesystem::path stage =
-      parent / ("." + spec.publish_dir.filename().string() + ".stage-" + decimal(::getpid()));
+  // M505 MUTANT: no staging — the builder writes straight into the published
+  // path, so a process killed mid-build leaves a half shard published.
+  const std::filesystem::path stage = spec.publish_dir;
   std::filesystem::remove_all(stage, code);
   if (!std::filesystem::create_directory(stage, code)) {
     return Result::refuse(
