engine/cpp/loader_selftest_scratch/bad_padding/tests/mutants/M608_pcg64_hashmix_shift.patch
--- a/qr_replay/src/pcg64.cpp
+++ b/qr_replay/src/pcg64.cpp
@@ -23,7 +23,7 @@
 constexpr std::uint32_t kMultB = 0x58f38dedu;
 constexpr std::uint32_t kMixMultL = 0xca01f9ddu;
 constexpr std::uint32_t kMixMultR = 0x4973f715u;
-constexpr int kXShift = 16;  // itemsize * 8 // 2 for uint32
+constexpr int kXShift = 15;  // MUTANT M608: off by one
 
 // --- PCG64 constants (numpy pcg64.h: PCG_DEFAULT_MULTIPLIER_128) ------------
 constexpr U128 kPcgMultiplier{0x2360ed051fc65da4ull, 0x4385df649fccf645ull};
