engine/cpp/loader_selftest_scratch/bad_padding/tests/mutants/M611_parity_fixture_case_dropped.patch
--- a/tests/fixtures/replay/pcg64_numpy_parity.tsv
+++ b/tests/fixtures/replay/pcg64_numpy_parity.tsv
@@ -277,10 +277,10 @@
 coin	749	41	5	1
 coin	749	41	6	0
 coin	749	41	7	0
-pool32	0	0	0	4229936048
-pool32	0	0	1	4267308384
-pool32	0	0	2	2724179127
-pool32	0	0	3	3157932105
+#dropped pool32	0	0	0	4229936048
+#dropped pool32	0	0	1	4267308384
+#dropped pool32	0	0	2	2724179127
+#dropped pool32	0	0	3	3157932105
 state32	0	0	0	2922648337
 state32	0	0	1	2845361893
 state32	0	0	2	3138925706
