engine/cpp/loader_selftest_scratch/bad_padding/tests/mutants/M705_nbbo_structural_even_sum_clause_dropped.patch
--- a/qr_nbbo/src/census.cpp
+++ b/qr_nbbo/src/census.cpp
@@ -158,7 +158,7 @@
   // rejects a member whose midpoint would not be an exact u6 integer.
   return *fields.bid_condition == 0 && *fields.ask_condition == 0 && *fields.bid_shares > 0 &&
          *fields.ask_shares > 0 && bid >= 1 && bid <= kMaxNormalizedNbboPriceU6 && ask >= 1 &&
-         ask <= kMaxNormalizedNbboPriceU6 && ask >= bid && (bid + ask) % 2 == 0;
+         ask <= kMaxNormalizedNbboPriceU6 && ask >= bid;  // M705: even-sum clause gone
 }
 
 // ---------------------------------------------------------------------------
