engine/cpp/loader_selftest_scratch/bad_padding/tests/mutants/M706_nbbo_scientific_bar_becomes_strict.patch
--- a/qr_nbbo/src/group_machine.cpp
+++ b/qr_nbbo/src/group_machine.cpp
@@ -104,7 +104,7 @@
     return Expected<bool, Refusal>::refuse(
         Refusal(RefusalCode::ARITHMETIC_OVERFLOW, kSpreadSite, "spread bar scaling overflowed"));
   }
-  return scaled_spread.value() <= scaled_total.value();
+  return scaled_spread.value() < scaled_total.value();  // M706: the bar excludes its edge
 }
 
 Expected<MemberClass, Refusal> classify_member(const qr::sources::StockQuoteRow& row) noexcept {
