engine/cpp/loader_selftest_scratch/bad_padding/tests/mutants/M720_nbbo_census_omits_the_quality_flag_rows.patch
--- a/qr_nbbo/src/census.cpp
+++ b/qr_nbbo/src/census.cpp
@@ -244,10 +244,7 @@
                    std::string("kind_groups.") + quote_kind_name(static_cast<QuoteKind>(index)),
                    kind_groups[index]);
   }
-  for (std::size_t index = 0; index < kQualityFlagCount; ++index) {
-    out += tsv_row(label, std::string("quality_flag_groups.") + quality_flag_name(index),
-                   quality_flag_groups[index]);
-  }
+  // M720: the quality-flag rows are no longer printed.
   out += tsv_row(label, "scientific_midpoints", scientific_midpoints);
   out += tsv_row(label, "wide_midpoints", wide_midpoints);
   for (std::size_t index = 0; index < kValidityCount; ++index) {
