engine/cpp/loader_selftest_scratch/bad_padding/tests/mutants/M820_labels_ledger_forgets_the_card_fields.patch
--- a/qr_labels/src/watches.cpp
+++ b/qr_labels/src/watches.cpp
@@ -289,7 +289,7 @@
       WatchRow row;
       row.candidate_id = candidate.candidate_id;
       row.candidate_physical_key = candidate.candidate_physical_key;
-      row.policy_name = candidate.policy_name;
+      row.policy_name.clear();  // MUTANT M820: the ledger forgets the policy
       row.reversal_bps = candidate.reversal_bps;
       row.member_count = candidate.member_count;
       row.visible_ts_ns = candidate.visible_ts_ns;
