engine/cpp/loader_selftest_scratch/bad_padding/tests/mutants/M902_census_runs_merge_across_milliseconds.patch
--- a/qr_census/src/differential.cpp
+++ b/qr_census/src/differential.cpp
@@ -301,7 +301,10 @@
     return;
   }
   const std::int64_t ts = cells[clock_index_].integer;
-  if (run_open_ && ts != run_ts_) {
+  // M902: there is no run boundary at all — the whole session becomes
+  // one run, so rows a millisecond apart are canonicalised together.
+  const bool boundary = false;
+  if (run_open_ && boundary) {
     flush_run();
   }
   run_ts_ = ts;
