engine/cpp/loader_selftest_scratch/bad_padding/tests/mutants/M918_census_join_key_drops_the_stream.patch
--- a/qr_census/src/differential.cpp
+++ b/qr_census/src/differential.cpp
@@ -358,7 +358,7 @@
   key += '|';
   key += ordinal;
   key += '|';
-  key += row.stream;
+  // M918: the stream leaves the join key.
   key += '|';
   key += row.name;
   key += '|';
