engine/cpp/loader_selftest_scratch/bad_padding/tests/mutants/M927_census_row_width_is_not_the_kinds_width.patch
--- a/qr_census/src/differential.cpp
+++ b/qr_census/src/differential.cpp
@@ -136,7 +136,7 @@
     case DiffKind::F64:
       return 8;
     case DiffKind::I32:
-      return 4;
+      return 8;  // M927: the image width no longer follows the kind.
     case DiffKind::U8:
       return 1;
   }
