engine/cpp/loader_selftest_scratch/bad_padding/tests/mutants/MA06_carriers_underlying_prior_takes_every_member.patch
--- a/qr_carriers/src/prior_state.cpp
+++ b/qr_carriers/src/prior_state.cpp
@@ -72,9 +72,10 @@
 bool UnderlyingPrior::observe_valid(std::int64_t underlying_ts_ns_a,
                                     std::int64_t underlying_u6) noexcept {
   if (!have_best_ || underlying_ts_ns_a > best_ts_ns_a_) {
+    // MA06: the accumulator is not reset, so members that do NOT share the
+    // greatest valid attachment enter the mean.
     have_best_ = true;
     best_ts_ns_a_ = underlying_ts_ns_a;
-    pending_.reset();
     return pending_.add(underlying_u6);
   }
   if (underlying_ts_ns_a == best_ts_ns_a_) {
