engine/cpp/loader_selftest_scratch/bad_padding/tests/mutants/MA29_carriers_sequence_takes_first_and_last_instead_of_min_and_max.patch
--- a/qr_carriers/include/qr_carriers/prior_state.hpp
+++ b/qr_carriers/include/qr_carriers/prior_state.hpp
@@ -341,12 +341,8 @@
       current_max_ = sequence;
       return;
     }
-    if (sequence < current_min_) {
-      current_min_ = sequence;
-    }
-    if (sequence > current_max_) {
-      current_max_ = sequence;
-    }
+    // MA29: a WITHIN-GROUP ORDER STATISTIC — first as min, last as max.
+    current_max_ = sequence;
   }
   /// The verdict for the CURRENT group against the FROZEN previous one.
   [[nodiscard]] Expected<SequenceVerdict, Refusal> verdict() const noexcept;
