engine/cpp/loader_selftest_scratch/bad_padding/tests/mutants/MA32_carriers_option_group_consumes_members_in_file_order.patch
--- a/qr_carriers/src/option_print_stream.cpp
+++ b/qr_carriers/src/option_print_stream.cpp
@@ -351,13 +351,9 @@
   const std::int64_t group_ts_ns_a = ts_a.value().ns();
 
   // Canonical member order BEFORE any floating-point reduction.
+  // MA32: same defect on the option stream — file order plus a mid-loop
+  // underlying-prior commit.
   canonical_.assign(rows.begin(), rows.end());
-  if (canonical_.size() > 1) {
-    std::sort(canonical_.begin(), canonical_.end(),
-              [](const OptionPrintRow& left, const OptionPrintRow& right) {
-                return canonical_less(left, right);
-              });
-  }
 
   GroupContext context;
   context.ts_ns_a = group_ts_ns_a;
@@ -479,6 +475,7 @@
       }
     }
 
+    underlying_prior_.commit_group();  // MA32: mid-loop commit
     // The two prior machines see the group's members only; both commit after it.
     const bool price_eligible =
         eligibility.eligible && !row.is_null(kPrintSlotPrice) && row.price_u6 > 0;
