engine/cpp/loader_selftest_scratch/bad_padding/tests/mutants/MA42_carriers_normalization_clip_bound_moved.patch
--- a/qr_carriers/include/qr_carriers/normalization.hpp
+++ b/qr_carriers/include/qr_carriers/normalization.hpp
@@ -47,7 +47,7 @@
 
 /// The scale floor and the clip bound, from the card.
 inline constexpr double kScaleFloor = 1e-6;
-inline constexpr double kNormalizationClip = 8.0;
+inline constexpr double kNormalizationClip = 6.0;  // MA42: not the card's [-8,8]
 
 /// One feature's moments within ONE session, over FINITE PRESENT values only.
 struct SessionMoments {
