engine/cpp/loader_selftest_scratch/bad_padding/tests/mutants/MA44_carriers_moment_width_mismatch_is_truncated.patch
--- a/qr_carriers/src/normalization.cpp
+++ b/qr_carriers/src/normalization.cpp
@@ -85,14 +85,9 @@
 
 Expected<bool, Refusal> NormalizationFitter::observe_session(
     std::span<const SessionMoments> moments) {
-  if (moments.size() != feature_count_) {
-    return Expected<bool, Refusal>::refuse(
-        Refusal(RefusalCode::CONTENT_MISMATCH, "qr_carriers::NormalizationFitter::observe_session",
-                "a session's moment vector has the wrong width",
-                static_cast<std::int64_t>(moments.size())));
-  }
+  // MA44: a short moment vector is silently truncated instead of refused.
   ++sessions_observed_;
-  for (std::size_t index = 0; index < feature_count_; ++index) {
+  for (std::size_t index = 0; index < moments.size(); ++index) {
     if (continuous_[index] == 0 || !moments[index].present()) {
       continue;
     }
