engine/cpp/loader_selftest_scratch/bad_padding/tests/mutants/MA46_carriers_candidate_set_offsets_carry_an_extra_entry.patch
--- a/qr_carriers/include/qr_carriers/candidate_set.hpp
+++ b/qr_carriers/include/qr_carriers/candidate_set.hpp
@@ -149,7 +149,13 @@
 /// `values`/`validity` as flat arrays and `offsets` beside them.
 class CandidateSetBlock {
  public:
-  CandidateSetBlock() { offsets_.push_back(0); }
+  // MA46: the CSR offsets carry an EXTRA entry, so every decision's slice is
+  // off by one — the exact shape the frozen reader's 2026-08-05 production probe
+  // caught on every real session while hand-built fixtures satisfied it.
+  CandidateSetBlock() {
+    offsets_.push_back(0);
+    offsets_.push_back(0);
+  }
 
   /// Appends ONE decision's visible-candidate rows, in the order given (the
   /// caller's order is the roster's own visibility order; nothing is sorted or
