engine/cpp/loader_selftest_scratch/bad_padding/tests/mutants/MB12_carriers_bin_destruction_ignores_its_own_flag.patch
--- a/qr_carriers/src/native_order.cpp
+++ b/qr_carriers/src/native_order.cpp
@@ -182,7 +182,7 @@
   }
 
 #ifndef QR_CARRIERS_NO_DESTRUCTIONS
-  if (controls_.bin_order_reverse) {
+  if (true) {  // MB12: the destruction no longer asks whether it was requested.
     // Section 7 (f): "reverses the value+mask tuples only within the ordered
     // valid in-session support of the 120 bins, leaves fixed pre-open
     // pads/validity in place, keeps the valid-bin multiset". The validity plane
