engine/cpp/loader_selftest_scratch/sha_mismatch/tests/mutants/M001_combine_table_cell.patch
--- a/qr_core/include/qr_core/validity.hpp
+++ b/qr_core/include/qr_core/validity.hpp
@@ -115,7 +115,7 @@
      CLOCK_UNAVAILABLE, MODALITY_ABSENT, MALFORMED},
     // row LOCKED
     {LOCKED, LOCKED, LOCKED, LOCKED,
-     LOCKED, LOCKED, LOCKED, CROSSED,
+     LOCKED, LOCKED, LOCKED, LOCKED,
      ONE_SIDED, NONFINITE, NONPOSITIVE, CONDITION_INELIGIBLE,
      CLOCK_UNAVAILABLE, MODALITY_ABSENT, LOCKED},
     // row CROSSED
