engine/cpp/loader_selftest_scratch/sha_mismatch/tests/mutants/M204_parquet_bitpack_offset.patch
--- a/qr_parquet/src/reader.cpp
+++ b/qr_parquet/src/reader.cpp
@@ -115,7 +115,7 @@
           const std::size_t window_bytes = (bit_offset + bit_width + 7U) / 8U;
           std::uint64_t window = 0;
           std::memcpy(&window, run + byte_index, window_bytes);
-          out[done + index] = static_cast<Out>((window >> bit_offset) & mask);
+          out[done + index] = static_cast<Out>(window & mask);
           bit_position += bit_width;
         }
       }
