engine/cpp/loader_selftest_scratch/sha_mismatch/tests/mutants/M417_corpus_profile_absorbs_the_publication_shape.patch
--- a/qr_parquet/include/qr_parquet/dialect.hpp
+++ b/qr_parquet/include/qr_parquet/dialect.hpp
@@ -189,8 +189,9 @@
 /// REQUIRED leaf is in the corpus family.
 [[nodiscard]] constexpr bool is_pinned_repetition(std::int32_t repetition,
                                                   DialectProfile profile) noexcept {
-  return profile == DialectProfile::PUBLICATION ? repetition == kRepetitionRequired
-                                                : is_pinned_repetition(repetition);
+  return profile == DialectProfile::PUBLICATION
+             ? repetition == kRepetitionRequired
+             : (is_pinned_repetition(repetition) || repetition == kRepetitionRequired);
 }
 
 // The PUBLICATION set, asserted at compile time. Only the publication branch is
