engine/cpp/loader_selftest_scratch/sha_mismatch/tests/mutants/M501_emit_header_padding_off_by_one.patch
--- a/qr_emit/src/npy_writer.cpp
+++ b/qr_emit/src/npy_writer.cpp
@@ -157,7 +157,9 @@
   // 10 + len(dict + pad + '\n') is a multiple of 64, and pad by a full 64 bytes
   // when the unpadded length already lands on the boundary.
   const std::size_t unpadded = kNpyPrologueFixedBytes + dict.size() + 1;
-  const std::size_t pad = kNpyHeaderAlignment - (unpadded % kNpyHeaderAlignment);
+  // M501 MUTANT: off by one — the payload no longer lands on a 64-byte
+  // boundary, which numpy's READER does not check.
+  const std::size_t pad = kNpyHeaderAlignment - (unpadded % kNpyHeaderAlignment) - 1;
   const std::size_t header_len = dict.size() + pad + 1;
   if (header_len > 0xFFFFU) {
     return Expected<std::string, Refusal>::refuse(config_refusal(
