engine/cpp/loader_selftest_scratch/sha_mismatch/tests/mutants/M701_nbbo_scalar_means_become_mean_of_derived.patch
--- a/qr_nbbo/src/group_machine.cpp
+++ b/qr_nbbo/src/group_machine.cpp
@@ -296,9 +296,12 @@
     // and nothing derived is summed here: the midpoint is computed from the
     // means afterwards, never averaged across rows.
     if (member.validity == Validity::VALID) {
+      // M701: the separate bid and ask scalar means are replaced by the mean
+      // of the ROW-DERIVED midpoint — the card section 7 named mutant.
+      const std::int64_t row_midpoint = (row.bid_u6 + row.ask_u6) / 2;
       const std::array<std::pair<ScalarMean*, std::int64_t>, 4> additions{
-          std::pair<ScalarMean*, std::int64_t>{&scalars.bid_u6, row.bid_u6},
-          std::pair<ScalarMean*, std::int64_t>{&scalars.ask_u6, row.ask_u6},
+          std::pair<ScalarMean*, std::int64_t>{&scalars.bid_u6, row_midpoint},
+          std::pair<ScalarMean*, std::int64_t>{&scalars.ask_u6, row_midpoint},
           std::pair<ScalarMean*, std::int64_t>{&scalars.bid_shares, row.bid_shares},
           std::pair<ScalarMean*, std::int64_t>{&scalars.ask_shares, row.ask_shares}};
       for (const auto& [accumulator, value] : additions) {
