engine/cpp/loader_selftest_scratch/sha_mismatch/tests/mutants/M704_nbbo_locked_and_crossed_become_eligible.patch
--- a/qr_nbbo/src/census.cpp
+++ b/qr_nbbo/src/census.cpp
@@ -128,13 +128,7 @@
   const bool bid_ok = bid == Validity::VALID;
   const bool ask_ok = ask == Validity::VALID;
   if (bid_ok && ask_ok) {
-    // ask > bid is the card's law; equality and inversion are typed quality
-    // tokens, and the value they carry is masked by being non-VALID.
-    if (*fields.bid_u6 == *fields.ask_u6) {
-      out = combine(out, Validity::LOCKED);
-    } else if (*fields.bid_u6 > *fields.ask_u6) {
-      out = combine(out, Validity::CROSSED);
-    }
+    // M704: locked and crossed quotes pass as ordinary two-sided ones.
   } else if (bid_ok || ask_ok) {
     out = combine(out, Validity::ONE_SIDED);
   }
