engine/cpp/loader_selftest_scratch/sha_mismatch/tests/mutants/M708_nbbo_group_count_live_wall_removed.patch
--- a/qr_nbbo/src/group_machine.cpp
+++ b/qr_nbbo/src/group_machine.cpp
@@ -180,12 +180,7 @@
                 ts_ms_b));
   }
   // THE REGISTRY IS A LIVE WALL, not just a final check (reader.rs:669-676).
-  if (pins_.complete_group_count > 0 &&
-      static_cast<std::int64_t>(groups_.size()) >= pins_.complete_group_count) {
-    return Expected<std::int64_t, Refusal>::refuse(
-        Refusal(RefusalCode::CONTENT_MISMATCH, kPushSite,
-                "decoded more groups than the registry's complete_group_count", ts_ms_b));
-  }
+  // M708: the registry count is no longer a live wall.
   for (const qr::sources::StockQuoteRow& row : rows) {
     if (row.ts_ms_b != ts_ms_b) {
       return Expected<std::int64_t, Refusal>::refuse(
