engine/cpp/loader_selftest_scratch/sha_mismatch/tests/mutants/M709_nbbo_group_without_eligible_member_becomes_the_prior.patch
--- a/qr_nbbo/src/group_machine.cpp
+++ b/qr_nbbo/src/group_machine.cpp
@@ -422,7 +422,7 @@
   // mean replace the prior state" — and a group with no eligible member never
   // becomes the prior, because the law names the nearest strictly-earlier
   // ELIGIBLE group.
-  if (scalars.eligible_count() > 0) {
+  if (scalars.eligible_count() >= 0) {  // M709: any group becomes the prior
     prior_.present = true;
     prior_.ts_ms_b = ts_ms_b;
     prior_.ts_ns_a = ts_a.value().ns();
