engine/cpp/loader_selftest_scratch/sha_mismatch/tests/mutants/M713_nbbo_a_split_equal_time_run_is_admitted.patch
--- a/qr_nbbo/src/group_machine.cpp
+++ b/qr_nbbo/src/group_machine.cpp
@@ -173,7 +173,7 @@
   // ONE GROUP PER MILLISECOND: a repeat of, or a descent below, the previous
   // group's stamp means the caller split an equal-time run — the exact hazard
   // the Validity lattice reserves EQUAL_TIME_UNORDERED for.
-  if (has_last_ts_ && ts_ms_b <= last_ts_ms_b_) {
+  if (has_last_ts_ && ts_ms_b < last_ts_ms_b_) {  // M713: a repeat is admitted
     return Expected<std::int64_t, Refusal>::refuse(
         Refusal(RefusalCode::OUT_OF_ORDER, kPushSite,
                 "group timestamps must strictly increase (equal-time runs are ONE group)",
