engine/cpp/loader_selftest_scratch/sha_mismatch/tests/mutants/M721_nbbo_imbalance_zero_denominator_guard_dropped.patch
--- a/qr_nbbo/src/quote_groups.cpp
+++ b/qr_nbbo/src/quote_groups.cpp
@@ -100,9 +100,7 @@
   // a strictly positive size on both sides, so a valid group's denominator is
   // at least 2 — but the guard is code, not an assumption, and it is what
   // stands between a degenerate book and a NaN travelling downstream.
-  if (denominator.value() == 0) {
-    return Typed<double>{0.0, Validity::MISSING};
-  }
+  // M721: a degenerate book divides anyway.
   // One IEEE division of two exactly-representable integers, with
   // -ffp-contract=off: deterministic, and bounded by |numerator| <=
   // denominator for nonnegative means.
