engine/cpp/loader_selftest_scratch/sha_mismatch/tests/mutants/M810_labels_one_to_one_guard_vacuous.patch
--- a/qr_labels/src/watches.cpp
+++ b/qr_labels/src/watches.cpp
@@ -236,6 +236,7 @@
 
 Expected<std::int64_t, Refusal> refuse_unless_one_to_one(
     std::span<const ActionRow> actions) noexcept {
+  return static_cast<std::int64_t>(actions.size());  // MUTANT M810
   for (std::size_t index = 0; index < actions.size(); ++index) {
     const ActionRow& current = actions[index];
     if (index > 0) {
