engine/cpp/loader_selftest_scratch/sha_mismatch/tests/mutants/M811_labels_mae_excludes_the_entry_mark.patch
--- a/qr_labels/src/label_kernel.cpp
+++ b/qr_labels/src/label_kernel.cpp
@@ -272,8 +272,9 @@
                                                        std::int64_t entry_index,
                                                        std::int64_t exit_index,
                                                        std::int64_t entry_u6, Side side) {
-  const std::int64_t worst =
-      worst_adverse_price(index.adverse(side), entry_index, exit_index, side);
+  const std::int64_t worst =  // MUTANT M811: the fill instant's own mark is skipped
+      worst_adverse_price(index.adverse(side), std::min(entry_index + 1, exit_index), exit_index,
+                          side);
   const Expected<std::int64_t, Refusal> worst_net = mark_net_cent(entry_u6, worst, side);
   if (!worst_net.has_value()) {
     return Expected<std::int64_t, Refusal>::refuse(worst_net.error());
