engine/cpp/loader_selftest_scratch/sha_mismatch/tests/mutants/M906_census_waiver_set_opened.patch
--- a/qr_census/src/verdict.cpp
+++ b/qr_census/src/verdict.cpp
@@ -183,7 +183,10 @@
   return cpp_bucket_total == sum;
 }
 
-bool is_legal_waiver_id(std::string_view waiver_id) noexcept { return waiver_id == kWcdWaiverId; }
+bool is_legal_waiver_id(std::string_view waiver_id) noexcept {
+  (void)waiver_id;
+  return true;  // M906: the waiver set is open.
+}
 
 void apply_waiver(VerdictRow& row, std::string_view waiver_id) {
   if (!is_legal_waiver_id(waiver_id)) {
