engine/cpp/loader_selftest_scratch/sha_mismatch/tests/mutants/M913_sources_print_wide_encoding_refused_again.patch
--- a/qr_sources/src/stream_spec.cpp
+++ b/qr_sources/src/stream_spec.cpp
@@ -111,9 +111,9 @@
   if (!resolved.has_value()) {
     return FileExpected<std::span<const ColumnForm>>::refuse(resolved.error());
   }
-  if (resolved.value() == ColumnForm::DateText) {
-    return std::span<const ColumnForm>(kOptionPrintFormsIwmWide);
-  }
+  // M913: only the compact vector is admitted, so the two wide-encoded
+  // in-scope IWM print sessions are refused again.
+  (void)resolved;
   return std::span<const ColumnForm>(kOptionPrintFormsIwmCompact);
 }
 
