engine/cpp/loader_selftest_scratch/sha_mismatch/tests/mutants/M924_census_attach_buckets_ride_the_waiver.patch
--- a/qr_census/src/verdict.cpp
+++ b/qr_census/src/verdict.cpp
@@ -470,10 +470,12 @@
       const DumpRow& rhs = *right[ri].row;
       // The attachment TOTAL is the one row a waiver can reach; it is compared
       // after the whole join, when wcd_skipped is known.
-      if (lhs.kind == "attach" && lhs.name == "total") {
+      if (lhs.kind == "attach") {  // M924: every attach row rides the waiver
         AttachPair& pair = attach_slot(lhs.ordinal, lhs.day);
-        pair.have_cpp_total = as_i64(lhs.value, pair.cpp_total);
-        pair.have_rust_total = as_i64(rhs.value, pair.rust_total);
+        if (lhs.name == "total") {
+          pair.have_cpp_total = as_i64(lhs.value, pair.cpp_total);
+          pair.have_rust_total = as_i64(rhs.value, pair.rust_total);
+        }
       } else {
         builder.add(field_of(lhs), rhs.value, lhs.value,
                     lhs.value == rhs.value ? Verdict::PASS : Verdict::FAIL);
