engine/cpp/loader_selftest_scratch/sha_mismatch/tests/mutants/M951_reflection_skips_the_own_opposite_relation_swap.patch
--- a/python/campaign/controls.py
+++ b/python/campaign/controls.py
@@ -248,9 +248,7 @@
     for column in synth.LOCATION_SIGMA:
         location[:, column] = -location[:, column]
     candset = batch.candset.clone()
-    own = candset[..., synth.CANDSET_OWN_INDEX].clone()
-    candset[..., synth.CANDSET_OWN_INDEX] = candset[..., synth.CANDSET_OPPOSITE_INDEX]
-    candset[..., synth.CANDSET_OPPOSITE_INDEX] = own
+    # M951 MUTANT: the own/opposite relation one-hot is left unreflected.
     return _replace(batch, groups=tuple(groups), direct=direct, loc_value=location,
                     candset=candset)
 
