engine/cpp/loader_selftest_scratch/sha_mismatch/tests/mutants/MA18_carriers_nbbo_gets_a_nonstructural_attachment_fraction.patch
--- a/qr_carriers/src/direct_raw.cpp
+++ b/qr_carriers/src/direct_raw.cpp
@@ -338,8 +338,9 @@
   if (modality_ == Modality::STOCK_NBBO) {
     // "For NBBO, attachment-invalid and sequence-inversion are typed structural
     // zeros" — present, with the value 0, not masked.
-    row.set(base + kDirectUnusableAttachmentFraction, structural_bit(false));
-    row.set(base + kDirectSequenceInversionFraction, structural_bit(false));
+    // MA18: NBBO's structural zeros become masked fractions.
+    row.set(base + kDirectUnusableAttachmentFraction, masked(Validity::MISSING));
+    row.set(base + kDirectSequenceInversionFraction, masked(Validity::MISSING));
   } else {
     const std::int64_t unusable =
         pre_unusable_tokens_[full.hi] - pre_unusable_tokens_[full.lo];
