engine/cpp/loader_selftest_scratch/sha_mismatch/tests/mutants/MA39_carriers_policy_vocabulary_order_permuted.patch
--- a/qr_carriers/include/qr_carriers/candidate_set.hpp
+++ b/qr_carriers/include/qr_carriers/candidate_set.hpp
@@ -53,8 +53,9 @@
 /// ONE-HOT ORDER is a model-facing frozen layout, not a roster detail: a change
 /// in the roster's ordering must not silently permute a feature column.
 inline constexpr std::array<std::string_view, 12> kPolicyVocabulary{
+    // MA39: the frozen one-hot order is permuted, so a feature column moves.
     "dc001", "dc002", "dc003", "dc004", "dc005", "dc006",
-    "dc007", "dc008", "dc010", "dc012", "dc015", "dc020"};
+    "dc007", "dc008", "dc012", "dc010", "dc015", "dc020"};
 inline constexpr std::size_t kPolicyVocabularySize = 12;
 
 /// The five visibility-recency horizons, in the card's own order.
