engine/cpp/loader_selftest_scratch/sha_mismatch/tests/mutants/MB06_carriers_visibility_equal_group_counts_as_approach.patch
--- a/qr_carriers/include/qr_carriers/native_order.hpp
+++ b/qr_carriers/include/qr_carriers/native_order.hpp
@@ -139,7 +139,8 @@
     if (!reference_present) {
       return Phase::PHASE_EQUAL_UNORDERED;
     }
-    if (group_index < equal_lo) {
+    // MB06: the visibility-equal group is folded into APPROACH.
+    if (group_index < equal_hi) {
       return Phase::APPROACH;
     }
     if (group_index >= equal_hi) {
