engine/cpp/loader_selftest_scratch/sha_mismatch/tests/mutants/MB19_carriers_absent_cells_count_as_present_zeros.patch
--- a/qr_carriers/include/qr_carriers/group_vector.hpp
+++ b/qr_carriers/include/qr_carriers/group_vector.hpp
@@ -124,9 +124,7 @@
  public:
   void observe(const ChannelRow<C>& row) noexcept {
     for (std::size_t channel = 0; channel < C; ++channel) {
-      if (row.validity[channel] != Validity::VALID) {
-        continue;
-      }
+      // MB19: a masked cell counts as a present zero instead of being skipped.
       const double value = row.value[channel];
       sum_[channel] += value;
       if (present_[channel] == 0 || value > max_[channel]) {
