engine/cpp/loader_selftest_scratch/sha_mismatch/tests/mutants/MC09_candidates_not_admitted_census_merges_its_two_reasons.patch
--- a/qr_candidates/src/roster.cpp
+++ b/qr_candidates/src/roster.cpp
@@ -337,12 +337,8 @@
       // Primitive, counted, NOT admitted — and never merged into the admitted
       // set or silently dropped from the primitive census. The two reasons stay
       // apart; a row can carry both.
-      if (!scorable.value()) {
-        roster.census.primitive_not_admitted_unscorable += 1;
-      }
-      if (!has_visibility) {
-        roster.census.primitive_not_admitted_no_visibility += 1;
-      }
+      // MC09 MUTANT: one merged bucket instead of two typed reasons.
+      roster.census.primitive_not_admitted_unscorable += 1;
       continue;
     }
     roster.census.admitted_rows += 1;
