engine/cpp/loader_selftest_scratch/sha_mismatch/tests/mutants/MD03_campaign_emitter_creates_the_publish_directory_up_front.patch
--- a/qr_campaign/src/driver.cpp
+++ b/qr_campaign/src/driver.cpp
@@ -526,6 +526,11 @@
   if (!dir.has_value()) {
     return Result::refuse(dir.error());
   }
+  // MD03: the emitter creates the published shard directory before it writes
+  // anything, so a worker that dies mid-session leaves a published-looking
+  // shard behind.
+  std::error_code mutant_code;
+  std::filesystem::create_directories(dir.value(), mutant_code);
   qr::emit::ShardSpec spec;
   spec.publish_dir = dir.value();
   spec.session_ordinal = ordinal;
