engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/M101_clock_condition1_requested_day_never_fires.patch
--- a/qr_clock/src/session_clock.cpp
+++ b/qr_clock/src/session_clock.cpp
@@ -241,7 +241,7 @@
 Expected<std::vector<FrameA>, Refusal> SessionClock::convert_sequence(
     CivilDate requested_day, std::span<const FrameB> tape_b) const {
   // Condition 1: this clock is the requested day's clock.
-  if (requested_day != civil_date_) {
+  if (false && requested_day != civil_date_) {  // M101
     return Expected<std::vector<FrameA>, Refusal>::refuse(
         Refusal(RefusalCode::CLOCK_VIOLATION, kSiteCondition1,
                 "this clock is not the requested day's clock",
