engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/M302_sources_print_projection_drifts_off_appendix_b.patch
--- a/qr_sources/include/qr_sources/stream_spec.hpp
+++ b/qr_sources/include/qr_sources/stream_spec.hpp
@@ -460,7 +460,7 @@
               "dte",          "moneyness",    "prem",       "delta_flow",
               "gamma_flow",   "vanna_flow",   "speed_flow", "zomma_flow",
               "charm_flow",   "vomma_flow"},
-    .projection = {1, 2, 3, 4, 5, 10, 11, 13, 14, 20, 21, 22, 34, 36, 37, 39, 40, 42, 43, 45},
+    .projection = {1, 2, 3, 4, 5, 10, 11, 13, 14, 20, 21, 22, 34, 36, 37, 39, 40, 42, 43, 46},
     .roles = {ColumnRole::Date,        // expiration(1)
               ColumnRole::Strike,      // strike(2)
               ColumnRole::Text,        // right(3)
