engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/M312_sources_name_pin_not_compared.patch
--- a/qr_sources/src/stream_spec.cpp
+++ b/qr_sources/src/stream_spec.cpp
@@ -209,7 +209,7 @@
 
   // 2. every column NAME, in order — including the ones never decoded.
   for (std::size_t leaf = 0; leaf < leaves.size(); ++leaf) {
-    if (leaves[leaf].name != spec.names()[leaf]) {
+    if (false && leaves[leaf].name != spec.names()[leaf]) {
       std::string detail(spec.stream());
       detail += ": column ";
       detail += std::to_string(leaf);
