engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/M313_sources_absent_modality_treated_as_present.patch
--- a/qr_sources/src/session_source.cpp
+++ b/qr_sources/src/session_source.cpp
@@ -32,7 +32,7 @@
     const std::filesystem::path& corpus_root, const DayScope& scope) {
   const std::filesystem::path flat = day_file(corpus_root, scope);
   std::error_code error;
-  if (std::filesystem::is_regular_file(flat, error)) {
+  if (true || std::filesystem::is_regular_file(flat, error)) {
     return std::vector<std::filesystem::path>{flat};
   }
   const std::string& day = scope.day();
