engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/M508_emit_shard_dir_shape_unchecked.patch
--- a/qr_emit/src/shard_writer.cpp
+++ b/qr_emit/src/shard_writer.cpp
@@ -97,6 +97,9 @@
 
 Status validate_c4_shard_dir(const std::filesystem::path& dir, std::int64_t session_ordinal,
                              Side side) {
+  // M508 MUTANT: the C4 shard-name wall is opened, so a tape can be published
+  // under any directory name at all, including another session's.
+  return ok_status();
   // `<base>/s0125/L` — the last two components and nothing looser. A trailing
   // slash strips the filename, so "s0125/L/" refuses here rather than silently
   // publishing one level up.
