engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/M511_loader_skips_the_npy_header_alignment_gate.patch
--- a/python/decision_tape_loader.py
+++ b/python/decision_tape_loader.py
@@ -148,11 +148,9 @@
         if prologue[6] != 1 or prologue[7] != 0:
             _refuse(f"{path}: .npy version {prologue[6]}.{prologue[7]}, the ruling is 1.0")
         header_len = int.from_bytes(prologue[8:10], "little")
-        if (10 + header_len) % NPY_ALIGNMENT != 0:
-            _refuse(
-                f"{path}: header of {header_len} bytes leaves the payload at offset "
-                f"{10 + header_len}, which is not a multiple of {NPY_ALIGNMENT}"
-            )
+        # M511 MUTANT: the 64-byte alignment gate is gone, so an off-by-one
+        # header reaches numpy, which does not check it either.
+        pass
         header = handle.read(header_len)
     if len(header) != header_len:
         _refuse(f"{path}: header is truncated")
@@ -237,7 +235,8 @@
             _refuse(f"{leaf.rel_path}: file shape {shape} != manifest {leaf.shape}")
         expected = header_bytes + int(np.prod(leaf.shape, dtype=np.int64)) * dtype.itemsize
         actual = path.stat().st_size
-        if actual != expected:
+        # M511 MUTANT: the size cross-check is gone too.
+        if False and actual != expected:
             _refuse(f"{leaf.rel_path}: {actual} bytes on disk, {expected} implied by the manifest")
         return actual
 
