engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/M615_replay_horizon_wall_off_by_one.patch
--- a/qr_replay/src/replay.cpp
+++ b/qr_replay/src/replay.cpp
@@ -101,7 +101,7 @@
                                       std::span<const ScoredAction> actions,
                                       PolicyGate& gate,
                                       const ReplayPolicy& policy) {
-  if (policy.horizon_index >= kHorizonCount) {
+  if (policy.horizon_index > kHorizonCount) {  // MUTANT M615: off by one
     return refuse<DailyLedger>(Refusal(RefusalCode::CONFIG, "qr_replay::replay/horizon",
                                        "horizon index outside the frozen 7-menu",
                                        static_cast<std::int64_t>(policy.horizon_index)));
