engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/M620_gate_warmup_off_by_one.patch
--- a/qr_replay/include/qr_replay/policy_gate.hpp
+++ b/qr_replay/include/qr_replay/policy_gate.hpp
@@ -138,7 +138,7 @@
   }
 
   /// True once the population has cleared the preregistered warm-up floor.
-  [[nodiscard]] bool is_warm() const noexcept { return population_size() >= kGateWarmupMinimum; }
+  [[nodiscard]] bool is_warm() const noexcept { return population_size() > kGateWarmupMinimum; }  // MUTANT M620
 
   /// The current running threshold; only defined once the population is
   /// non-empty and non-degenerate. (Being defined is not being ADMISSIBLE: the
