engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/M816_labels_stop_hit_includes_the_horizon_group.patch
--- a/qr_labels/src/label_kernel.cpp
+++ b/qr_labels/src/label_kernel.cpp
@@ -348,7 +348,7 @@
 
     std::int64_t exit_index = horizon_index;
     bool stopped = false;
-    if (row.scan.crossed && row.scan.crossing_index < horizon_index) {
+    if (row.scan.crossed && row.scan.crossing_index <= horizon_index) {  // MUTANT M816
       // "stop before h": the crossing is STRICTLY before this horizon's exit,
       // so the fill is the next lawful mark after the crossing — which exists,
       // because the horizon's own group is one.
