engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/M817_labels_key_side_check_removed.patch
--- a/qr_labels/src/label_kernel.cpp
+++ b/qr_labels/src/label_kernel.cpp
@@ -289,7 +289,7 @@
   LabelRow row;
   row.menu.key = key;
   row.menu.cost_charged_cent = kTradeCostCent;
-  if (key.side != side) {
+  if (false && key.side != side) {  // MUTANT M817
     return Expected<LabelRow, Refusal>::refuse(
         Refusal(RefusalCode::CONTENT_MISMATCH, kLabelSite,
                 "the action key's side is not the side being labelled",
