engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/M821_labels_second_ts_off_by_one_nanosecond.patch
--- a/qr_labels/src/watches.cpp
+++ b/qr_labels/src/watches.cpp
@@ -72,7 +72,7 @@
   if (!offset.has_value()) {
     return Expected<std::int64_t, Refusal>::refuse(offset.error());
   }
-  return checked_add(session_start_ns_, offset.value());
+  return checked_add(session_start_ns_ + 1, offset.value());  // MUTANT M821
 }
 
 Expected<std::int64_t, Refusal> DecisionClock::second_of(std::int64_t ts) const noexcept {
