engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/M825_labels_push_group_guards_removed.patch
--- a/qr_labels/src/execution_tape.cpp
+++ b/qr_labels/src/execution_tape.cpp
@@ -151,13 +151,13 @@
     return Expected<bool, Refusal>::refuse(
         Refusal(RefusalCode::CONTENT_MISMATCH, kPushSite, "an empty equal-time group", ts_ms_b));
   }
-  if (has_last_ts_ && ts_ms_b <= last_ts_ms_b_) {
+  if (false && has_last_ts_ && ts_ms_b <= last_ts_ms_b_) {  // MUTANT M825
     return Expected<bool, Refusal>::refuse(
         Refusal(RefusalCode::OUT_OF_ORDER, kPushSite,
                 "equal-time groups must arrive strictly increasing", ts_ms_b));
   }
   for (const qr::sources::StockQuoteRow& row : rows) {
-    if (row.ts_ms_b != ts_ms_b) {
+    if (false && row.ts_ms_b != ts_ms_b) {  // MUTANT M825
       return Expected<bool, Refusal>::refuse(
           Refusal(RefusalCode::CONTENT_MISMATCH, kPushSite,
                   "a member does not carry its own group's millisecond", row.ts_ms_b));
@@ -170,7 +170,8 @@
   if (!ts_b.has_value()) {
     return Expected<bool, Refusal>::refuse(ts_b.error());
   }
-  const Expected<FrameA, Refusal> ts_a = clock_.to_frame_a(ts_b.value());
+  const Expected<FrameA, Refusal> ts_a =  // MUTANT M825: no RTH window
+      clock_.to_frame_a_same_civil_day(ts_b.value());
   if (!ts_a.has_value()) {
     return Expected<bool, Refusal>::refuse(ts_a.error());
   }
