engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/M909_census_uncompared_columns_not_enumerated.patch
--- a/qr_census/src/differential.cpp
+++ b/qr_census/src/differential.cpp
@@ -217,7 +217,7 @@
 std::span<const UncomparedColumn> uncompared_columns(DiffStream stream) noexcept {
   switch (stream) {
     case DiffStream::StockQuotes:
-      return kStockQuoteUncompared;
+      return {};  // M909: the coverage statement is dropped.
     case DiffStream::StockTrades:
       return kStockTradeUncompared;
     case DiffStream::OptionPrints:
