engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/M917_census_empty_dump_is_an_empty_agreement.patch
--- a/qr_census/src/differential.cpp
+++ b/qr_census/src/differential.cpp
@@ -430,10 +430,7 @@
     row.value = std::string(fields[6]);
     rows.push_back(std::move(row));
   }
-  if (!header_seen) {
-    return Expected<std::vector<DumpRow>, Refusal>::refuse(
-        Refusal(RefusalCode::SCHEMA_MISMATCH, kParseSite, "dump is empty: no header row", 0));
-  }
+  // M917: an empty dump is an empty agreement.
   return rows;
 }
 
