engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/M926_census_a_compared_column_is_also_claimed_uncomparable.patch
--- a/qr_census/src/differential.cpp
+++ b/qr_census/src/differential.cpp
@@ -26,7 +26,7 @@
 };
 
 constexpr std::array<UncomparedColumn, 4> kStockQuoteUncompared{
-    UncomparedColumn{"bid_exchange", ColumnSide::CppOnly,
+    UncomparedColumn{"bid_u6", ColumnSide::CppOnly,  // M926
                      "B1 projection EXTENDED vs the frozen reader's [0,1,3,5,7]"},
     UncomparedColumn{"bid_condition", ColumnSide::CppOnly,
                      "B1 projection EXTENDED vs the frozen reader's [0,1,3,5,7]"},
