engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/M949_scalar_injection_never_writes_the_scalar.patch
--- a/python/campaign/controls.py
+++ b/python/campaign/controls.py
@@ -148,7 +148,8 @@
         else:
             injected = targets.risk[:, 0]          # stop_hit before h_ref, a bit
         value = batch.loc_value.clone()
-        value[:, synth.SESSION_TIME_FRACTION_INDEX] = injected.to(value.dtype)
+        # M949 MUTANT: the injection is computed and thrown away.
+        _ = injected
         return (_replace(batch, loc_value=value), targets)
 
 
