engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/MA04_carriers_prior_updates_inside_the_member_loop.patch
--- a/qr_carriers/include/qr_carriers/prior_state.hpp
+++ b/qr_carriers/include/qr_carriers/prior_state.hpp
@@ -128,7 +128,16 @@
   }
   /// Observes ONE eligible member (condition-eligible, finite positive price).
   [[nodiscard]] bool observe_eligible_price(std::int64_t price_u6) noexcept {
-    return pending_.add(price_u6);
+    // MA04: the prior moves inside the member loop, leaking member 1 into the
+    // comparison member 2 makes.
+    if (!pending_.add(price_u6)) {
+      return false;
+    }
+    const Typed<std::int64_t> running = pending_.mean();
+    if (running.v == Validity::VALID) {
+      prior_ = PriorScalar{true, pending_ts_ns_a_, running.value};
+    }
+    return true;
   }
   /// "only after the whole current group is reduced does its eligible finite
   /// mean replace the prior state"; a group with no eligible member never
