engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/MA19_carriers_option_greeks_need_only_one_attachment.patch
--- a/qr_carriers/src/option_print_stream.cpp
+++ b/qr_carriers/src/option_print_stream.cpp
@@ -115,7 +115,8 @@
   // **both** strict-prior attachments".
   const Validity greek_dependency =
       both(inputs.quote_attachment.validity(), underlying_dependency);
-  const bool greeks_ok = quote_clock_ok && underlying_usable;
+  // MA19: the Greeks stop requiring BOTH strict-prior attachments.
+  const bool greeks_ok = quote_clock_ok || underlying_usable;
 
   // ONE union indicator per print over every dependency it requires — never one
   // per failed reason. Two simultaneous failures are still one unusable print.
