engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/MA20_carriers_rv_admits_a_single_endpoint.patch
--- a/qr_carriers/src/grid_1s.cpp
+++ b/qr_carriers/src/grid_1s.cpp
@@ -72,7 +72,12 @@
   for (std::size_t index = first + 1U; index <= endpoint_index; ++index) {
     const GridPoint& previous = points_[index - 1U];
     const GridPoint& current = points_[index];
-    if (!previous.present || !current.present || previous.mid_u6 <= 0 || current.mid_u6 <= 0) {
+    // MA20: RV no longer requires two present CONSECUTIVE endpoints.
+    if (!current.present || current.mid_u6 <= 0) {
+      continue;
+    }
+    if (!previous.present || previous.mid_u6 <= 0) {
+      ++pairs;
       continue;
     }
     // A carried unchanged midpoint gives log(1) = 0 and contributes nothing.
