engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/MB00_carriers_native_stub_genesis.patch
--- a/qr_carriers/src/native_order.cpp
+++ b/qr_carriers/src/native_order.cpp
@@ -126,7 +126,8 @@
     micro.slot_phase[slot] = phase;
     ++micro.phase_slots[static_cast<std::size_t>(phase)];
   }
-  return micro;
+  // MB00 (stub genesis): the micro carrier does not exist yet.
+  return MicroCarrier{};
 }
 
 Expected<BinCarrier, Refusal> NativeOrderBuilder::build_bins(const DecisionWindow& window) const {
@@ -209,7 +210,8 @@
   }
 #endif
 
-  return bins;
+  // MB00 (stub genesis): the bin carrier does not exist yet.
+  return BinCarrier{};
 }
 
 // ---------------------------------------------------------------------------
