engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/MB14_carriers_emission_door_trusts_the_carrier.patch
--- a/qr_carriers/src/native_order.cpp
+++ b/qr_carriers/src/native_order.cpp
@@ -300,8 +300,8 @@
       }
       continue;
     }
-    const std::int32_t expected =
-        micro.start + static_cast<std::int32_t>(slot - static_cast<std::size_t>(micro.left_pad));
+    // MB14: the door compares the slot against itself.
+    const std::int32_t expected = micro.slot_group[slot];
     if (micro.slot_group[slot] != expected) {
       return Expected<std::size_t, Refusal>::refuse(
           content("the micro carrier is not the chronological production run",
