engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/MC20_checker_ignores_the_census_scope_marker.patch
--- a/python/check_truth_separation.py
+++ b/python/check_truth_separation.py
@@ -207,8 +207,9 @@
     it are two directories, and the question — "does this file name it?" — needs
     no parse. A checker that only understood Python could not ask it at all.
     """
+    # MC20 MUTANT: every file is treated as a qr_emit internal.
     normalised = str(path).replace("\\", "/")
-    if any(owner in normalised for owner in CENSUS_SCOPE_OWNERS):
+    if normalised:
         return []
     violations: list[str] = []
     for number, line in enumerate(text.splitlines(), start=1):
