engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/loader_selftest_scratch/sha_mismatch/tests/mutants/MC24_emit_publish_skips_the_digest_collision_check.patch
--- a/qr_emit/src/shard_writer.cpp
+++ b/qr_emit/src/shard_writer.cpp
@@ -406,7 +406,8 @@
   // compares once per publish; there is no index to keep consistent and no
   // hidden cost to measure.
   for (const NpyLeafReceipt& feature : leaves_) {
-    if (!leaf_is_in_section(feature, Section::FEATURES)) {
+    // MC24 MUTANT: the digest-collision refusal never looks at a leaf.
+    if (true || !leaf_is_in_section(feature, Section::FEATURES)) {
       continue;
     }
     for (const NpyLeafReceipt& truth : leaves_) {
