engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/tests/mutants/M004_stale_diag_outranks_unavailability.patch
--- a/qr_core/include/qr_core/validity.hpp
+++ b/qr_core/include/qr_core/validity.hpp
@@ -90,29 +90,29 @@
      CLOCK_UNAVAILABLE, MODALITY_ABSENT, MALFORMED},
     // row MISSING
     {MISSING, MISSING, EQUAL_TIME_UNORDERED, ATTACHMENT_FUTURE,
-     WRONG_CIVIL_DAY, MISSING, LOCKED, CROSSED,
+     WRONG_CIVIL_DAY, STALE_DIAG, LOCKED, CROSSED,
      ONE_SIDED, NONFINITE, NONPOSITIVE, CONDITION_INELIGIBLE,
      CLOCK_UNAVAILABLE, MODALITY_ABSENT, MALFORMED},
     // row EQUAL_TIME_UNORDERED
     {EQUAL_TIME_UNORDERED, EQUAL_TIME_UNORDERED, EQUAL_TIME_UNORDERED, ATTACHMENT_FUTURE,
-     WRONG_CIVIL_DAY, EQUAL_TIME_UNORDERED, LOCKED, CROSSED,
+     WRONG_CIVIL_DAY, STALE_DIAG, LOCKED, CROSSED,
      ONE_SIDED, NONFINITE, NONPOSITIVE, CONDITION_INELIGIBLE,
      CLOCK_UNAVAILABLE, MODALITY_ABSENT, MALFORMED},
     // row ATTACHMENT_FUTURE
     {ATTACHMENT_FUTURE, ATTACHMENT_FUTURE, ATTACHMENT_FUTURE, ATTACHMENT_FUTURE,
-     WRONG_CIVIL_DAY, ATTACHMENT_FUTURE, LOCKED, CROSSED,
+     WRONG_CIVIL_DAY, STALE_DIAG, LOCKED, CROSSED,
      ONE_SIDED, NONFINITE, NONPOSITIVE, CONDITION_INELIGIBLE,
      CLOCK_UNAVAILABLE, MODALITY_ABSENT, MALFORMED},
     // row WRONG_CIVIL_DAY
     {WRONG_CIVIL_DAY, WRONG_CIVIL_DAY, WRONG_CIVIL_DAY, WRONG_CIVIL_DAY,
-     WRONG_CIVIL_DAY, WRONG_CIVIL_DAY, LOCKED, CROSSED,
+     WRONG_CIVIL_DAY, STALE_DIAG, LOCKED, CROSSED,
      ONE_SIDED, NONFINITE, NONPOSITIVE, CONDITION_INELIGIBLE,
      CLOCK_UNAVAILABLE, MODALITY_ABSENT, MALFORMED},
     // row STALE_DIAG
-    {STALE_DIAG, MISSING, EQUAL_TIME_UNORDERED, ATTACHMENT_FUTURE,
-     WRONG_CIVIL_DAY, STALE_DIAG, LOCKED, CROSSED,
+    {STALE_DIAG, STALE_DIAG, STALE_DIAG, STALE_DIAG,
+     STALE_DIAG, STALE_DIAG, LOCKED, CROSSED,
      ONE_SIDED, NONFINITE, NONPOSITIVE, CONDITION_INELIGIBLE,
-     CLOCK_UNAVAILABLE, MODALITY_ABSENT, MALFORMED},
+     CLOCK_UNAVAILABLE, MODALITY_ABSENT, STALE_DIAG},
     // row LOCKED
     {LOCKED, LOCKED, LOCKED, LOCKED,
      LOCKED, LOCKED, LOCKED, CROSSED,
@@ -155,7 +155,7 @@
      MODALITY_ABSENT, MODALITY_ABSENT, MODALITY_ABSENT},
     // row MALFORMED
     {MALFORMED, MALFORMED, MALFORMED, MALFORMED,
-     MALFORMED, MALFORMED, LOCKED, CROSSED,
+     MALFORMED, STALE_DIAG, LOCKED, CROSSED,
      ONE_SIDED, NONFINITE, NONPOSITIVE, CONDITION_INELIGIBLE,
      CLOCK_UNAVAILABLE, MODALITY_ABSENT, MALFORMED},
 };
