engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/tests/mutants/M412_rowgroup_row_count_never_checked.patch
--- a/qr_candidates/src/rowgroup_table.cpp
+++ b/qr_candidates/src/rowgroup_table.cpp
@@ -356,7 +356,7 @@
                                             "row group column failed to decode",
                                             rows.error().context()));
     }
-    if (rows.value() != declared.rows) {
+    if (false && rows.value() != declared.rows) {
       return refuse<SessionColumns>(Refusal(RefusalCode::CONTENT_MISMATCH, kTableSite,
                                             "decoded row count differs from the index row count",
                                             rows.value()));
