engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/tests/mutants/M416_publication_reader_declares_the_corpus_profile.patch
--- a/qr_candidates/src/rowgroup_table.cpp
+++ b/qr_candidates/src/rowgroup_table.cpp
@@ -240,7 +240,7 @@
   // family it reads; a corpus-shaped file (OPTIONAL leaves, an INT64 column)
   // is refused here exactly as loudly as a publication-shaped file is refused
   // by a corpus reader.
-  auto opened = qr::parquet::File::open(path, qr::parquet::DialectProfile::PUBLICATION);
+  auto opened = qr::parquet::File::open(path, qr::parquet::DialectProfile::CORPUS);
   if (!opened) {
     if (refusal_detail != nullptr) {
       *refusal_detail = opened.error().message();
