engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/tests/mutants/M506_emit_census_records_before_its_role.patch
--- a/qr_emit/src/fd_census.cpp
+++ b/qr_emit/src/fd_census.cpp
@@ -187,9 +187,8 @@
   }
   CensusState& census = state();
   const std::lock_guard<std::mutex> lock(census.mutex);
-  if (!census.recording) {
-    return true;
-  }
+  // M506 MUTANT: the census records opens made before any role was declared, so
+  // a run's record is contaminated with everything the process did at start-up.
   census.opens_seen += 1;
   const std::string_view view(path);
   const bool truth = path_has_truth_component(view);
