engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/tests/mutants/M604_scorecard_initial_zero_removed.patch
--- a/qr_replay/src/scorecard.cpp
+++ b/qr_replay/src/scorecard.cpp
@@ -88,7 +88,8 @@
   // drawdown is max_k(running_max - Ek). Every session is in the sequence,
   // zero-trade ones included, and nothing is interpolated inside a day.
   std::int64_t equity = 0;       // E0
-  std::int64_t running_max = 0;  // "include E0 in the running maximum"
+  std::int64_t running_max = 0;
+  bool first_equity = true;  // MUTANT M604: E0 dropped from the running maximum
   card.mdd_cent = 0;             // k = 0 contributes running_max - E0 = 0
   for (const std::int64_t daily : card.session_net_cent) {
     const Expected<std::int64_t, Refusal> next = checked_add(equity, daily);
@@ -96,7 +97,10 @@
       return refuse<Scorecard>(next.error());
     }
     equity = next.value();
-    if (equity > running_max) {
+    if (first_equity) {
+      running_max = equity;
+      first_equity = false;
+    } else if (equity > running_max) {
       running_max = equity;
     }
     const Expected<std::int64_t, Refusal> drawdown = checked_sub(running_max, equity);
