engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/tests/mutants/M614_replay_census_drops_occupied_clocks.patch
--- a/qr_replay/src/replay.cpp
+++ b/qr_replay/src/replay.cpp
@@ -285,7 +285,9 @@
       }
     }
 
-    ledger.clock_census[census_index(outcome)] += 1;
+    if (outcome != ClockOutcome::OCCUPIED) {  // MUTANT M614: a clock vanishes from the census
+      ledger.clock_census[census_index(outcome)] += 1;
+    }
 
     // --- causality: the clock's own rows join the population only AFTER every
     // decision at this clock has been made.
