engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/tests/mutants/M616_scorecard_drawdown_sign_flipped.patch
--- a/qr_replay/src/scorecard.cpp
+++ b/qr_replay/src/scorecard.cpp
@@ -96,10 +96,10 @@
       return refuse<Scorecard>(next.error());
     }
     equity = next.value();
-    if (equity > running_max) {
+    if (equity < running_max) {  // MUTANT M616: a running MINIMUM
       running_max = equity;
     }
-    const Expected<std::int64_t, Refusal> drawdown = checked_sub(running_max, equity);
+    const Expected<std::int64_t, Refusal> drawdown = checked_sub(equity, running_max);
     if (!drawdown.has_value()) {
       return refuse<Scorecard>(drawdown.error());
     }
