engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/tests/mutants/M802_labels_entry_admits_exact_equality.patch
--- a/qr_labels/src/label_kernel.cpp
+++ b/qr_labels/src/label_kernel.cpp
@@ -297,7 +297,7 @@
   }
 
   // --- the entry rule ------------------------------------------------------
-  const std::int64_t entry_index = tape.first_strictly_after(key.decision_ts_ns);
+  const std::int64_t entry_index = tape.first_at_or_after(key.decision_ts_ns);  // MUTANT M802
   if (entry_index == kNoIndex) {
     row.menu.state = LabelState::ENTRY_UNAVAILABLE;
     return row;
