engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/tests/mutants/M807_labels_cost_charged_twice.patch
--- a/qr_labels/src/money.cpp
+++ b/qr_labels/src/money.cpp
@@ -30,7 +30,7 @@
   if (!gross.has_value()) {
     return Expected<std::int64_t, Refusal>::refuse(gross.error());
   }
-  return checked_sub(gross.value(), kTradeCostCent);
+  return checked_sub(gross.value(), 2 * kTradeCostCent);  // MUTANT M807
 }
 
 Expected<std::int64_t, Refusal> move_u6(std::int64_t entry_u6, std::int64_t mark_u6,
