engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/tests/mutants/M905_census_wcd_injection_reconciliation_missing.patch
--- a/qr_census/src/verdict.cpp
+++ b/qr_census/src/verdict.cpp
@@ -175,12 +175,10 @@
   if (wcd_count <= 0) {
     return false;
   }
-  // Checked: the sum of two dump-supplied integers must not wrap into a match.
-  std::int64_t sum = 0;
-  if (__builtin_add_overflow(rust_total, wcd_count, &sum)) {
-    return false;
-  }
-  return cpp_bucket_total == sum;
+  // M905 (THE WCD INJECTION MUTANT): the wrong-civil-day count is never
+  // added back, so an injected WCD attachment cannot reconcile and the
+  // reconciliation path fails first.
+  return cpp_bucket_total == rust_total;
 }
 
 bool is_legal_waiver_id(std::string_view waiver_id) noexcept { return waiver_id == kWcdWaiverId; }
