engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/tests/mutants/M907_census_missing_counterpart_is_skipped.patch
--- a/qr_census/src/verdict.cpp
+++ b/qr_census/src/verdict.cpp
@@ -490,7 +490,8 @@
         AttachPair& pair = attach_slot(lhs.ordinal, lhs.day);
         pair.have_cpp_total = as_i64(lhs.value, pair.cpp_total);
       } else {
-        builder.add(field_of(lhs), "ABSENT", lhs.value, Verdict::FAIL);
+        // M907: a key the other side does not carry becomes a census row.
+        builder.add(field_of(lhs), "ABSENT", lhs.value, Verdict::CENSUS);
       }
       ++li;
       continue;
