engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/tests/mutants/M925_census_verdict_header_unpinned.patch
--- a/qr_census/src/verdict.cpp
+++ b/qr_census/src/verdict.cpp
@@ -242,11 +242,7 @@
       continue;
     }
     if (!header_seen) {
-      if (line != kVerdictHeader) {
-        return Expected<ArchiveSummary, Refusal>::refuse(Refusal(
-            RefusalCode::SCHEMA_MISMATCH, kSite, "verdict header is not the pinned header",
-            line_number));
-      }
+      // M925: any first line is accepted as the verdict header.
       header_seen = true;
       continue;
     }
