engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/tests/mutants/M948_cosine_decays_to_zero_not_to_1e4_of_peak.patch
--- a/python/campaign/train.py
+++ b/python/campaign/train.py
@@ -52,7 +52,7 @@
 SEED = 20260810
 PEAK_LR = 1e-3
 WEIGHT_DECAY = 1e-4
-COSINE_FLOOR_FRACTION = 1e-4        # "cosine decay to 1e-4-of-peak"
+COSINE_FLOOR_FRACTION = 0.0        # M948 MUTANT: decays to zero
 FIRST_BUDGET_EPOCHS = 30
 SECOND_BUDGET_EPOCHS = 60
 UNDERTRAINED_THRESHOLD = 0.01       # ">1% over the final 3 epochs"
