engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/tests/mutants/MA05_carriers_nbbo_mid_becomes_mean_of_derived.patch
--- a/qr_carriers/src/prior_state.cpp
+++ b/qr_carriers/src/prior_state.cpp
@@ -13,8 +13,9 @@
   if (bid.v != Validity::VALID || ask.v != Validity::VALID) {
     return Typed<std::int64_t>{0, Validity::MISSING};
   }
-  // `midpoint_u6` is WP4's overflow-free form of (bid+ask)/2.
-  return Typed<std::int64_t>{qr::sources::midpoint_u6(bid.value, ask.value), Validity::VALID};
+  // MA05: the midpoint is taken before the scalar means (mean-of-derived).
+  const std::int64_t members = bid_u6.count;
+  return Typed<std::int64_t>{(bid_u6.sum + ask_u6.sum) / (2 * members), Validity::VALID};
 }
 
 Typed<std::int64_t> NbboScalars::spread() const noexcept {
