engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/tests/mutants/MA09_carriers_visibility_equal_group_counts_as_approach.patch
--- a/qr_carriers/src/direct_raw.cpp
+++ b/qr_carriers/src/direct_raw.cpp
@@ -310,8 +310,10 @@
     // "< visibility is APPROACH, > visibility is RESPONSE, and == visibility is
     // PHASE_EQUAL_UNORDERED ... enters neither phase denominator." The groups are
     // ordered by timestamp, so the split is two binary searches, not a scan.
+    // MA09: the visibility-equal group is folded into APPROACH instead of
+    // being typed PHASE_EQUAL_UNORDERED and excluded from both denominators.
     const std::size_t equal_lo =
-        std::max(full.lo, std::min(full.hi, lower_bound_ts(window.phase_reference_ns_a)));
+        std::max(full.lo, std::min(full.hi, upper_bound_ts(window.phase_reference_ns_a)));
     const std::size_t equal_hi =
         std::max(full.lo, std::min(full.hi, upper_bound_ts(window.phase_reference_ns_a)));
     const std::int64_t approach = static_cast<std::int64_t>(equal_lo - full.lo);
