engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/tests/mutants/MA33_carriers_iso_parse_accepts_out_of_range_clock_fields.patch
--- a/qr_carriers/src/attach.cpp
+++ b/qr_carriers/src/attach.cpp
@@ -147,7 +147,8 @@
       !digits(text, 20, 3, milli)) {
     return std::nullopt;
   }
-  if (hour > 23 || minute > 59 || second > 59) {
+  // MA33: the parse stops range-checking its own clock fields.
+  if (false) {
     return std::nullopt;
   }
   const std::int64_t day_ms = civil.value().days_since_epoch() * kMillisecondsPerDay;
