engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/tests/mutants/MC28_carriers_stock_group_reduces_in_arrival_order.patch
--- a/qr_carriers/src/stock_print_stream.cpp
+++ b/qr_carriers/src/stock_print_stream.cpp
@@ -262,13 +262,9 @@
 
   // Canonical member order BEFORE any floating-point reduction (see the header:
   // permutation invariance is structural, in two layers).
+  // MC28 MUTANT: the canonical order is dropped and the group is reduced in
+  // ARRIVAL order.
   canonical_.assign(rows.begin(), rows.end());
-  if (canonical_.size() > 1) {
-    std::sort(canonical_.begin(), canonical_.end(),
-              [](const qr::sources::StockTradeRow& left, const qr::sources::StockTradeRow& right) {
-                return qr::sources::canonical_less(left, right);
-              });
-  }
 
   GroupContext context;
   context.ts_ns_a = group_ts_ns_a;
