engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/bad_padding/tests/mutants/MD06_campaign_handoff_reader_accepts_an_unwritten_header.patch
--- a/qr_campaign/src/handoff.cpp
+++ b/qr_campaign/src/handoff.cpp
@@ -182,15 +182,11 @@
   HandoffReader reader;
   reader.base_ = static_cast<const std::uint8_t*>(mapping);
   reader.size_ = size;
-  if (std::memcmp(reader.base_, kHandoffMagic.data(), kHandoffMagic.size()) != 0) {
-    return Result::refuse(content("the handoff blob does not carry the driver's magic"));
-  }
+  // MD06: the reader stops checking that the header was ever written — neither
+  // the magic nor the "at least one leaf" clause — so a blob from a feature
+  // builder that died mid-run maps as an empty but well-formed tape.
   const std::uint64_t count = load_u64(reader.base_ + 32);
   const std::uint64_t end = load_u64(reader.base_ + 40);
-  if (count == 0) {
-    return Result::refuse(content("the handoff blob describes no leaf: the feature builder did "
-                                  "not finish"));
-  }
   if (count > kHandoffMaxLeaves || end > size) {
     return Result::refuse(content("the handoff header is inconsistent with the blob",
                                   static_cast<std::int64_t>(count)));
