engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/sha_mismatch/tests/mutants/M109_clock_wcd_only_types_future_days.patch
--- a/qr_clock/src/session_clock.cpp
+++ b/qr_clock/src/session_clock.cpp
@@ -298,7 +298,7 @@
   if (!delta_days.has_value()) {
     return AttachClass::malformed();
   }
-  if (delta_days.value() != 0) {
+  if (delta_days.value() > 0) {  // M109
     return AttachClass::wrong_civil_day(delta_days.value());
   }
 
