engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/sha_mismatch/tests/mutants/M111_clock_wall_open_offset_off_by_one_minute.patch
--- a/qr_clock/include/qr_clock/session_clock.hpp
+++ b/qr_clock/include/qr_clock/session_clock.hpp
@@ -80,7 +80,7 @@
 /// source timestamps are wall-clock milliseconds in that same local
 /// convention, so this offset is DST-free BY CONSTRUCTION — which is exactly
 /// why frame B needs no timezone table (session_clock.rs:72-76).
-inline constexpr std::int64_t kWallOpenOffsetMs = 9 * 3'600'000 + 30 * 60'000;
+inline constexpr std::int64_t kWallOpenOffsetMs = 9 * 3'600'000 + 31 * 60'000;  // M111
 
 // ---------------------------------------------------------------------------
 // The totalized attachment classifier's result type.
