engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/sha_mismatch/tests/mutants/M301_sources_price_lead_wall_removed.patch
--- a/qr_sources/include/qr_sources/stream_spec.hpp
+++ b/qr_sources/include/qr_sources/stream_spec.hpp
@@ -387,7 +387,7 @@
 // = quote-certified aggressor + own/opposite; attached exchanges (12,16) =
 // internalization proxy; 19-21,23 NEVER READ; **price_lead_1(22)
 // DECODE-REFUSED** (future-looking; name-pinned only)."
-inline constexpr StreamSpec<24, 19, 5> kStockTradeSpec{
+inline constexpr StreamSpec<24, 19, 4> kStockTradeSpec{
     .stream = "stock_trades",
     .names = {"trade_timestamp", "quote_timestamp", "sequence", "ext_condition1", "ext_condition2",
               "ext_condition3", "ext_condition4", "condition", "size", "exchange", "price",
@@ -402,10 +402,6 @@
     .forbidden = {ForbiddenColumn{19, ForbidReason::NeverRead},
                   ForbiddenColumn{20, ForbidReason::NeverRead},
                   ForbiddenColumn{21, ForbidReason::NeverRead},
-                  // THE NAME-PINNED FUTURE FIELD. It stays in `names` so drift
-                  // is still detected, and it is walled so decoding it is a
-                  // typed refusal rather than a silent leak of the answer.
-                  ForbiddenColumn{22, ForbidReason::DecodeRefused},
                   ForbiddenColumn{23, ForbidReason::NeverRead}},
     .timestamp_leaf = 0,
 };
