engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/sha_mismatch/tests/mutants/M307_sources_share_era_boundary_off_by_one_day.patch
--- a/qr_sources/src/normalize.cpp
+++ b/qr_sources/src/normalize.cpp
@@ -40,7 +40,7 @@
   }
   // ISO days compare lexicographically, so this IS chronological
   // (`reader.rs:1343-1351`).
-  if (day >= kShareEraFirstDay) {
+  if (day > kShareEraFirstDay) {
     return raw;
   }
   return checked_mul(raw, kSharesPerLot);
