engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/sha_mismatch/tests/mutants/M314_sources_committed_registry_count_edited.patch
--- a/tests/fixtures/real_file_digests.tsv
+++ b/tests/fixtures/real_file_digests.tsv
@@ -150,7 +150,7 @@
 IWM_sources_stock_quotes_2022-07-05	file	-	num_row_groups	126
 IWM_sources_stock_quotes_2022-07-05	file	-	row_groups_kept	121
 IWM_sources_stock_quotes_2022-07-05	file	-	num_leaves	16
-IWM_sources_stock_quotes_2022-07-05	file	-	rth_rows	14761979
+IWM_sources_stock_quotes_2022-07-05	file	-	rth_rows	14761978
 IWM_sources_stock_quotes_2022-07-05	file	-	group_count	2810589
 IWM_sources_stock_quotes_2022-07-05	file	-	decoded_values	133816320
 IWM_sources_stock_quotes_2022-07-05	file	-	output_digest_i64	5644360210660433492
