engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/sha_mismatch/tests/mutants/M411_header_read_in_one_block.patch
--- a/qr_candidates/src/prefix_reader.cpp
+++ b/qr_candidates/src/prefix_reader.cpp
@@ -356,9 +356,24 @@
   // --- the header, one byte at a time --------------------------------------
   std::int64_t offset = 0;
   std::string header;
-  if (const auto step = bytewise_line(event, offset, seal.event_stats, true, header, &consumed);
-      !step) {
-    return refuse<PrefixSeal>(step.error());
+  {
+    // M411: read the header in ONE block instead of byte by byte.
+    std::vector<std::uint8_t> probe(4096);
+    const auto step = event.read_at(probe.data(), probe.size(), 0);
+    if (!step) {
+      return refuse<PrefixSeal>(step.error());
+    }
+    seal.event_stats.pread_calls += 1;
+    seal.event_stats.requested_bytes += probe.size();
+    const auto* newline = static_cast<const std::uint8_t*>(
+        std::memchr(probe.data(), '\n', probe.size()));
+    if (newline == nullptr) {
+      return refuse<PrefixSeal>(Refusal(RefusalCode::DECODE_FAILED, kSite, "no header newline"));
+    }
+    const std::size_t length = static_cast<std::size_t>(newline - probe.data());
+    header.assign(reinterpret_cast<const char*>(probe.data()), length);
+    consumed.update(probe.data(), length + 1);
+    offset = static_cast<std::int64_t>(length) + 1;
   }
   if (header != signal_header()) {
     return refuse<PrefixSeal>(Refusal(RefusalCode::SCHEMA_MISMATCH, kSite,
