engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/sha_mismatch/tests/mutants/M602_replay_double_cost.patch
--- a/qr_replay/src/replay.cpp
+++ b/qr_replay/src/replay.cpp
@@ -260,7 +260,7 @@
             trade.key = row.key;
             trade.entry_ts_ns = row.label.entry_ts_ns;
             trade.exit_ts_ns = row.label.menu_exit_ts[h];
-            trade.net_cent = row.label.menu_net_cent[h];
+            trade.net_cent = row.label.menu_net_cent[h] - kTradeCostCent;  // MUTANT M602: charged twice
             trade.mae_cent = row.label.menu_mae_cent[h];
             trade.stop_hit = row.label.stop_hit[h] != 0;
 
