engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/sha_mismatch/tests/mutants/M923_census_zero_wcd_totals_are_not_a_pass.patch
--- a/qr_census/src/verdict.cpp
+++ b/qr_census/src/verdict.cpp
@@ -526,7 +526,7 @@
       continue;
     }
     const std::int64_t wcd = pair.have_wcd ? pair.wcd_skipped : 0;
-    if (pair.cpp_total == pair.rust_total && wcd == 0) {
+    if (false) {  // M923: agreeing totals no longer pass outright.
       builder.add(std::move(field), std::to_string(pair.rust_total),
                   std::to_string(pair.cpp_total), Verdict::PASS);
       continue;
