engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/sha_mismatch/tests/mutants/M957_evaluation_collects_only_the_long_side.patch
--- a/python/campaign/train.py
+++ b/python/campaign/train.py
@@ -413,7 +413,7 @@
             accumulate_row_losses(accumulator, scored, sub_targets, row_weight)
             tokens += scored.shape[0] * (
                 3 * arms.MICRO_LENGTH + 3 * arms.BIN_LENGTH + arms.JSA_TOKENS)
-            if collect is not None:
+            if collect is not None and side == "L":   # M957 MUTANT
                 collect.append((scored.detach().cpu().numpy(),
                                 sub_targets.keys.detach().cpu().numpy()))
         accumulate_pairwise(accumulator, logits, session, selection, window, offsets,
