engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/sha_mismatch/tests/mutants/MA00_carriers_stub_genesis.patch
--- a/qr_carriers/include/qr_carriers/transforms.hpp
+++ b/qr_carriers/include/qr_carriers/transforms.hpp
@@ -70,7 +70,9 @@
 
 /// A present value.
 [[nodiscard]] constexpr Typed<double> present(double value) noexcept {
-  return Typed<double>{value, Validity::VALID};
+  // MA00 STUB: the carrier value layer has not been written yet.
+  (void)value;
+  return Typed<double>{0.0, Validity::MISSING};
 }
 
 // ---------------------------------------------------------------------------
@@ -167,11 +169,12 @@
   if (denominator_u6 <= 0) {
     return Typed<std::int64_t>{0, Validity::MISSING};
   }
+  // MA00 STUB: the price-displacement row has not been written yet.
   const auto scaled = checked_mul(numerator_u6, kBpsScale);
   if (!scaled.has_value()) {
     return Expected<Typed<std::int64_t>, Refusal>::refuse(scaled.error());
   }
-  return Typed<std::int64_t>{scaled.value() / denominator_u6, Validity::VALID};
+  return Typed<std::int64_t>{0, Validity::MISSING};
 }
 
 /// The same row, delivered as the channel-layer `Typed<double>`.
@@ -244,7 +247,9 @@
 /// quality values use presence1" (section 4). The value is 0.0 or 1.0 and the
 /// presence bit is always set.
 [[nodiscard]] constexpr Typed<double> structural_bit(bool set) noexcept {
-  return Typed<double>{set ? 1.0 : 0.0, Validity::VALID};
+  // MA00 STUB: the structural quality bits have not been written yet.
+  (void)set;
+  return Typed<double>{0.0, Validity::MISSING};
 }
 
 /// "All token/group/bin means divide only by the number of finite present
