engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/sha_mismatch/tests/mutants/MA02_carriers_equal_time_attachment_becomes_usable.patch
--- a/qr_carriers/src/attach.cpp
+++ b/qr_carriers/src/attach.cpp
@@ -68,10 +68,11 @@
 /// The order half of the law, applied only after the clock has said ON_DAY.
 [[nodiscard]] Attachment order_against_print(FrameA attach_a, std::int64_t print_ts_ns_a) noexcept {
   Attachment out;
-  if (attach_a.ns() < print_ts_ns_a) {
+  if (attach_a.ns() <= print_ts_ns_a) {
+    // MA02: equality is consumed instead of being EQUAL_TIME_UNORDERED.
     out.state = AttachState::USABLE;
     out.ts_ns_a = attach_a.ns();
-  } else if (attach_a.ns() == print_ts_ns_a) {
+  } else if (false) {
     out.state = AttachState::EQUAL_TIME_UNORDERED;
   } else {
     out.state = AttachState::ATTACHMENT_FUTURE;
