engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/sha_mismatch/tests/mutants/MA11_carriers_gamma_is_side_oriented.patch
--- a/qr_carriers/src/option_print_stream.cpp
+++ b/qr_carriers/src/option_print_stream.cpp
@@ -233,7 +233,8 @@
       greeks_ok ? greek_cell(row, kPrintSlotImpliedVol, row.implied_vol)
                 : masked(greek_dependency);
   channels.set(kOpOrientedDelta, oriented(delta, sigma));
-  channels.set(kOpGamma, gamma);  // side-invariant, by name
+  // MA11: gamma stops being side-invariant.
+  channels.set(kOpGamma, oriented(gamma, sigma));
   channels.set(kOpOrientedVanna, oriented(vanna, sigma));
   channels.set(kOpOrientedCharm, oriented(charm, sigma));
   channels.set(kOpImpliedVol, implied_vol);
@@ -265,7 +266,7 @@
     for (const auto& entry : flows) {
       // Gamma flow is side-invariant exactly as gamma is; the other three carry
       // sigma because their Greek is "already signed".
-      const double factor = entry.first == static_cast<std::size_t>(kOpGammaFlow) ? 1.0 : sigma;
+      const double factor = sigma;  // MA11: gamma-flow stops being side-invariant.
       if (!aggressor_resolved || !size_present || entry.second.v != Validity::VALID) {
         channels.set(entry.first,
                      masked(entry.second.v != Validity::VALID
