engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/sha_mismatch/tests/mutants/MA14_carriers_visibility_flags_lose_their_horizon.patch
--- a/qr_carriers/src/candidate_set.cpp
+++ b/qr_carriers/src/candidate_set.cpp
@@ -99,7 +99,9 @@
   const std::int64_t age_ns = cutoff_ns_a - candidate.visible_ts_ns_a;
   for (std::size_t index = 0; index < kVisibilityFlagCount; ++index) {
     const std::int64_t horizon_ns = kVisibilityFlagSeconds[index] * kNanosPerSecond;
-    row.set(kCandVisibilityFlags + index, structural_bit(age_ns <= horizon_ns));
+    // MA14: the recency flags become strict, so a candidate exactly at its
+    // horizon stops being visible-in-last-k.
+    row.set(kCandVisibilityFlags + index, structural_bit(age_ns < horizon_ns));
   }
   return row;
 }
