engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/sha_mismatch/tests/mutants/MA41_carriers_absent_feature_still_increments_its_session_count.patch
--- a/qr_carriers/src/normalization.cpp
+++ b/qr_carriers/src/normalization.cpp
@@ -93,7 +93,8 @@
   }
   ++sessions_observed_;
   for (std::size_t index = 0; index < feature_count_; ++index) {
-    if (continuous_[index] == 0 || !moments[index].present()) {
+    // MA41: a session with NO present value still increments that feature's S.
+    if (continuous_[index] == 0) {
       continue;
     }
     // EQUAL SESSION WEIGHT: the session's own MEAN enters the outer mean, not
