engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/sha_mismatch/tests/mutants/MB02_carriers_nbbo_group_vector_divides_a_group_row_by_its_members.patch
--- a/qr_carriers/src/nbbo_stream.cpp
+++ b/qr_carriers/src/nbbo_stream.cpp
@@ -260,9 +260,13 @@
           options_.side_spot_stride > 0 &&
           static_cast<std::int64_t>(groups_.size()) % options_.side_spot_stride == 0;
       if (side == Side::LONG) {
+        // MB02: the group-level row is OBSERVED once but reduced against the
+        // member count, so a k-member group reports 1/k presence.
         std::array<double, kNbboNeutralDim> neutral{};
-        reduce_constant_group_neutral(Modality::STOCK_NBBO, channels,
-                                      record.log1p_multiplicity, neutral);
+        GroupReducer<kNbboChannelCount> reducer;
+        reducer.observe(channels);
+        reducer.write_neutral(Modality::STOCK_NBBO, record.token_count,
+                              record.log1p_multiplicity, neutral);
         vectors_.append(neutral);
         if (spot_group) {
           spot_groups_.push_back(static_cast<std::int32_t>(groups_.size()));
