engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/sha_mismatch/tests/mutants/MB03_carriers_micro_carrier_admits_the_equal_cutoff_group.patch
--- a/qr_carriers/src/native_order.cpp
+++ b/qr_carriers/src/native_order.cpp
@@ -71,8 +71,8 @@
 }
 
 std::size_t NativeOrderBuilder::groups_before(std::int64_t cutoff_ns) const noexcept {
-  // "Current/equal-cutoff tokens are excluded" — lower_bound, not upper_bound.
-  return lower_bound_ts(cutoff_ns, 0);
+  // MB03: the equal-cutoff group joins the carrier.
+  return upper_bound_ts(cutoff_ns, 0);
 }
 
 PhaseSplit NativeOrderBuilder::split_for(const DecisionWindow& window) const noexcept {
