engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/sha_mismatch/tests/mutants/MC22_emit_truth_allowlist_matches_basenames.patch
--- a/qr_emit/src/fd_census.cpp
+++ b/qr_emit/src/fd_census.cpp
@@ -278,9 +278,11 @@
         // allowlist is small (the truth leaves of the folds in scope), so the
         // linear scan costs nothing and a suffix match cannot be a binary
         // search over basenames.
+        // MC22 MUTANT: basename matching, which cannot bind the fold wall.
+        const std::string leaf(path_basename(view));
         refused = true;
         for (const std::string& entry : census.truth_allowlist) {
-          if (path_ends_with_qualified_leaf(view, entry)) {
+          if (path_basename(entry) == leaf) {
             refused = false;
             break;
           }
