engine/cpp/loader_selftest_scratch/wrong_shape/loader_selftest_scratch/sha_mismatch/tests/mutants/MC27_emit_truth_receipt_counts_every_open_not_only_truth.patch
--- a/qr_emit/src/fd_census.cpp
+++ b/qr_emit/src/fd_census.cpp
@@ -451,7 +451,9 @@
 
 std::vector<FdCensus::TruthOpenRow> FdCensus::truth_open_receipt() const {
   std::vector<TruthOpenRow> rows;
-  for (const OpenRecord& record : truth_records()) {
+  // MC27 MUTANT: the receipt folds EVERY open, so a feature builder that never
+  // touched truth still publishes a non-empty truth-open receipt.
+  for (const OpenRecord& record : records()) {
     const std::string_view scope = truth_session_scope(record.path);
     // A truth path with no session/side above it is itself a finding, so it is
     // REPORTED under an explicit label rather than dropped from the receipt.
