engine/cpp/loader_selftest_scratch/wrong_shape/tests/mutants/M105_clock_condition5_offset_equality_never_fires.patch
--- a/qr_clock/src/session_clock.cpp
+++ b/qr_clock/src/session_clock.cpp
@@ -225,7 +225,7 @@
   if (!event_offset_ns.has_value()) {
     return overflow<FrameA>(kSiteCondition5, "ts_B - open_B overflowed", ts_b.ns());
   }
-  if (back_offset_ns.value() != event_offset_ns.value()) {
+  if (false && back_offset_ns.value() != event_offset_ns.value()) {  // M105
     return Expected<FrameA, Refusal>::refuse(
         Refusal(RefusalCode::CLOCK_VIOLATION, kSiteCondition5,
                 "offset equality violated: ts_A - session_start != ts_B - open_B",
