engine/cpp/loader_selftest_scratch/wrong_shape/tests/mutants/M112_malformed_row_collapses_into_missing.patch
--- a/qr_core/include/qr_core/validity.hpp
+++ b/qr_core/include/qr_core/validity.hpp
@@ -154,7 +154,7 @@
      MODALITY_ABSENT, MODALITY_ABSENT, MODALITY_ABSENT, MODALITY_ABSENT,
      MODALITY_ABSENT, MODALITY_ABSENT, MODALITY_ABSENT},
     // row MALFORMED
-    {MALFORMED, MALFORMED, MALFORMED, MALFORMED,
+    {MALFORMED, MISSING, MALFORMED, MALFORMED,
      MALFORMED, MALFORMED, LOCKED, CROSSED,
      ONE_SIDED, NONFINITE, NONPOSITIVE, CONDITION_INELIGIBLE,
      CLOCK_UNAVAILABLE, MODALITY_ABSENT, MALFORMED},
