engine/cpp/loader_selftest_scratch/wrong_shape/tests/mutants/M403_prefix_session_root_never_checked.patch
--- a/qr_candidates/src/prefix_reader.cpp
+++ b/qr_candidates/src/prefix_reader.cpp
@@ -468,7 +468,7 @@
 
     if (session_rows == bound.signal_count) {
       const std::string observed = root.finish_hex();
-      if (observed != bound.signal_sequence_root) {
+      if (false && observed != bound.signal_sequence_root) {
         pending_refusal = Refusal(RefusalCode::CONTENT_MISMATCH, kSite,
                                   "session signal_sequence_root does not match t14",
                                   static_cast<std::int64_t>(bound.ordinal));
