engine/cpp/loader_selftest_scratch/wrong_shape/tests/mutants/M617_scorecard_leave_top_ten_boundary.patch
--- a/qr_replay/src/scorecard.cpp
+++ b/qr_replay/src/scorecard.cpp
@@ -109,7 +109,7 @@
   }
 
   // --- leave-top-10-out ------------------------------------------------------
-  if (card.session_count > 10) {
+  if (card.session_count >= 10) {  // MUTANT M617: off by one at the boundary
     std::vector<std::int64_t> sorted = card.session_net_cent;
     // Descending by net; the ten largest sessions come off the front. Sorting a
     // copy of the values keeps the panel independent of session order.
