engine/cpp/loader_selftest_scratch/wrong_shape/tests/mutants/M712_nbbo_group_member_stamp_never_checked.patch
--- a/qr_nbbo/src/group_machine.cpp
+++ b/qr_nbbo/src/group_machine.cpp
@@ -186,13 +186,7 @@
         Refusal(RefusalCode::CONTENT_MISMATCH, kPushSite,
                 "decoded more groups than the registry's complete_group_count", ts_ms_b));
   }
-  for (const qr::sources::StockQuoteRow& row : rows) {
-    if (row.ts_ms_b != ts_ms_b) {
-      return Expected<std::int64_t, Refusal>::refuse(
-          Refusal(RefusalCode::CONTENT_MISMATCH, kPushSite,
-                  "a member does not carry its own group's millisecond", row.ts_ms_b));
-    }
-  }
+  // M712: a member may carry any millisecond it likes.
 
   // The TOTALIZED domain classification (never the reference's `?`-abort).
   const QuoteDomain domain = classify_domain(clock_, ts_ms_b);
