engine/cpp/loader_selftest_scratch/wrong_shape/tests/mutants/M812_labels_barrier_reads_one_column_for_both_sides.patch
--- a/qr_labels/src/label_kernel.cpp
+++ b/qr_labels/src/label_kernel.cpp
@@ -200,7 +200,8 @@
     return Expected<BarrierOutcome, Refusal>::refuse(adverse_gate.error());
   }
 
-  out.favorable_index = first_crossing(index.favorable(side), first, last, favorable_gate.value());
+  out.favorable_index =  // MUTANT M812: SAME_GROUP_ADVERSE becomes unreachable
+      first_crossing(index.adverse(side), first, last, favorable_gate.value());
   out.adverse_index = first_crossing(index.adverse(side), first, last, adverse_gate.value());
 
   if (out.favorable_index != kNoIndex) {
