engine/cpp/loader_selftest_scratch/wrong_shape/tests/mutants/M916_census_dump_row_field_count_unchecked.patch
--- a/qr_census/src/differential.cpp
+++ b/qr_census/src/differential.cpp
@@ -408,11 +408,7 @@
       ++field;
       start = stop + 1;
     }
-    if (field != fields.size() || start <= line.size()) {
-      return Expected<std::vector<DumpRow>, Refusal>::refuse(
-          Refusal(RefusalCode::SCHEMA_MISMATCH, kParseSite,
-                  "dump row does not carry exactly seven tab-separated fields", line_number));
-    }
+    // M916: a short row is padded with empties instead of refused.
     DumpRow row;
     row.kind = std::string(fields[0]);
     const std::string ordinal_text(fields[1]);
