engine/cpp/loader_selftest_scratch/wrong_shape/tests/mutants/M922_census_attach_total_always_waived.patch
--- a/qr_census/src/verdict.cpp
+++ b/qr_census/src/verdict.cpp
@@ -531,7 +531,7 @@
                   std::to_string(pair.cpp_total), Verdict::PASS);
       continue;
     }
-    if (wcd_waiver_holds(pair.cpp_total, pair.rust_total, wcd)) {
+    if (true) {  // M922: any attachment-total delta is waived.
       builder.add_waived(std::move(field), std::to_string(pair.rust_total),
                          std::to_string(pair.cpp_total));
       continue;
