engine/cpp/loader_selftest_scratch/wrong_shape/tests/mutants/MA07_carriers_sequenceless_group_becomes_the_previous_group.patch
--- a/qr_carriers/include/qr_carriers/prior_state.hpp
+++ b/qr_carriers/include/qr_carriers/prior_state.hpp
@@ -352,10 +352,9 @@
   [[nodiscard]] Expected<SequenceVerdict, Refusal> verdict() const noexcept;
   /// "The previous group updates only after the current group is complete."
   void commit_group() noexcept {
-    if (have_current_) {
-      previous_present_ = true;
-      previous_max_ = current_max_;
-    }
+    // MA07: a group with no finite sequence still becomes the previous group.
+    previous_present_ = true;
+    previous_max_ = current_max_;
     have_current_ = false;
   }
   [[nodiscard]] bool previous_present() const noexcept { return previous_present_; }
