engine/cpp/loader_selftest_scratch/wrong_shape/tests/mutants/MA21_carriers_normalization_hash_drops_the_session_count.patch
--- a/qr_carriers/src/normalization.cpp
+++ b/qr_carriers/src/normalization.cpp
@@ -140,9 +140,9 @@
   for (std::size_t index = 0; index < table.size(); ++index) {
     const FeatureNormalization& entry = table[index];
     const int written =
-        std::snprintf(buffer, sizeof(buffer), "%zu\t%lld\t%.17g\t%.17g\t%d\n", index,
-                      static_cast<long long>(entry.sessions), entry.mu, entry.scale,
-                      entry.centered ? 1 : 0);
+        // MA21: S drops out of the hashed triple.
+        std::snprintf(buffer, sizeof(buffer), "%zu\t%d\t%.17g\t%.17g\t%d\n", index, 0,
+                      entry.mu, entry.scale, entry.centered ? 1 : 0);
     if (written <= 0 || static_cast<std::size_t>(written) >= sizeof(buffer)) {
       detail::fail_fast("qr::carriers::render_normalization: row did not fit");
     }
