engine/cpp/loader_selftest_scratch/wrong_shape/tests/mutants/MB13_carriers_recent128_reverse_takes_the_left_pad_with_it.patch
--- a/qr_carriers/src/native_order.cpp
+++ b/qr_carriers/src/native_order.cpp
@@ -113,19 +113,19 @@
       continue;
     }
     const std::size_t offset = slot - static_cast<std::size_t>(micro.left_pad);
-    std::size_t group = start + offset;
-#ifndef QR_CARRIERS_NO_DESTRUCTIONS
-    if (controls_.recent128_reverse) {
-      // Section 7 (e): "reversing the valid recent-128 timestamp-group sequence
-      // is reported". The VALID slots reverse; the typed left pad stays put.
-      group = before - 1 - offset;
-    }
-#endif
+    const std::size_t group = start + offset;
     micro.slot_group[slot] = static_cast<std::int32_t>(group);
     const Phase phase = split.phase_of(static_cast<std::int32_t>(group));
     micro.slot_phase[slot] = phase;
     ++micro.phase_slots[static_cast<std::size_t>(phase)];
   }
+#ifndef QR_CARRIERS_NO_DESTRUCTIONS
+  if (controls_.recent128_reverse) {
+    // MB13: the reversal takes the typed left pad with it.
+    std::reverse(micro.slot_group.begin(), micro.slot_group.end());
+    std::reverse(micro.slot_phase.begin(), micro.slot_phase.end());
+  }
+#endif
   return micro;
 }
 
