engine/cpp/loader_selftest_scratch/wrong_shape/tests/mutants/MB16_carriers_native_leaf_names_drop_the_modality.patch
--- a/qr_carriers/src/native_order.cpp
+++ b/qr_carriers/src/native_order.cpp
@@ -250,7 +250,9 @@
   if (stem == nullptr) {
     detail::fail_fast("qr::carriers::native_leaf_name: unknown leaf");
   }
-  return std::string(stem) + modality_leaf_suffix(modality);
+  // MB16: every modality writes the same leaf name.
+  static_cast<void>(modality);
+  return std::string(stem);
 }
 
 NativeOrderShard::NativeOrderShard(Modality modality, std::span<const GroupRecord> groups,
