engine/cpp/loader_selftest_scratch/wrong_shape/tests/mutants/MC11_carriers_attach_quote_reverts_to_the_v333_wording.patch
--- a/qr_carriers/include/qr_carriers/attach.hpp
+++ b/qr_carriers/include/qr_carriers/attach.hpp
@@ -246,8 +246,9 @@
 /// wording and the parsed set becomes {0} while the constant stays {0, 32};
 /// widen the constant and the sentence no longer covers it.
 inline constexpr std::string_view kDirectionEligibleConjunction =
+    // MC11 MUTANT: the V3.3.3 wording, restored beside the CC-008 vocabulary.
     "Thus a direction-eligible stock print requires primary code0, every present extended code "
-    "in {0,32}, finite positive price, and positive size.";
+    "in {0}, finite positive price, and positive size.";
 
 /// True when a PRESENT (non-sentinel) extended slot carries an admitted code.
 [[nodiscard]] constexpr bool is_extended_condition_admitted(std::int64_t code) noexcept {
