engine/cpp/loader_selftest_scratch/wrong_shape/tests/mutants/MC19_checker_drops_the_widened_taint_sinks.patch
--- a/python/check_truth_separation.py
+++ b/python/check_truth_separation.py
@@ -61,11 +61,7 @@
         "append",
         "cat",
         "concat",
-        # The write-into-a-tensor sinks (review F4/F5): the same move, spelled
-        # as a method instead of as a concatenation.
-        "put",
-        "put_along_axis",
-        "insert",
+        # MC19 MUTANT: the write-into-a-tensor sinks are gone.
     }
 )
 TRUTH_CALL = "truth"
@@ -132,15 +128,7 @@
         if self._expression_is_tainted(node.value):
             for target in node.targets:
                 self._bind(target)
-            # SETITEM: `feature_tensor[i] = truth_array`. Binding a NAME is taint
-            # propagation; writing through a SUBSCRIPT or an ATTRIBUTE is a write
-            # INTO an existing tensor, which is the thing the rule forbids.
-            for target in node.targets:
-                if isinstance(target, (ast.Subscript, ast.Attribute)):
-                    self.violations.append(
-                        f"{self.path}:{node.lineno}: a truth array is written into a tensor "
-                        f"by setitem"
-                    )
+            # MC19 MUTANT: setitem is not a sink.
         self.generic_visit(node)
 
     def visit_AnnAssign(self, node: ast.AnnAssign) -> None:  # noqa: N802
@@ -151,11 +139,7 @@
     def visit_AugAssign(self, node: ast.AugAssign) -> None:  # noqa: N802
         if self._expression_is_tainted(node.value):
             self._bind(node.target)
-            if isinstance(node.target, (ast.Subscript, ast.Attribute)):
-                self.violations.append(
-                    f"{self.path}:{node.lineno}: a truth array is written into a tensor "
-                    f"by setitem"
-                )
+            # MC19 MUTANT: augmented setitem is not a sink either.
         self.generic_visit(node)
 
     def visit_For(self, node: ast.For) -> None:  # noqa: N802
@@ -189,14 +173,7 @@
         # `out=`: the call names its own destination. Either the destination or
         # an operand being truth puts truth into a tensor, so a tainted argument
         # ANYWHERE in such a call is the violation.
-        elif any(keyword.arg == "out" for keyword in node.keywords):
-            for argument in arguments:
-                if self._expression_is_tainted(argument):
-                    self.violations.append(
-                        f"{self.path}:{node.lineno}: a truth array reaches a tensor through the "
-                        f"out= destination of {name}()"
-                    )
-                    break
+        # MC19 MUTANT: an out= destination is not a sink.
         self.generic_visit(node)
 
 
