engine/cpp/tests/mutants/M004_stale_diag_outranks_unavailability.patch
--- a/qr_core/include/qr_core/validity.hpp
+++ b/qr_core/include/qr_core/validity.hpp
@@ -76,27 +76,27 @@
      CLOCK_UNAVAILABLE, MODALITY_ABSENT},
     // row MISSING
     {MISSING, MISSING, EQUAL_TIME_UNORDERED, ATTACHMENT_FUTURE,
-     WRONG_CIVIL_DAY, MISSING, LOCKED, CROSSED,
+     WRONG_CIVIL_DAY, STALE_DIAG, LOCKED, CROSSED,
      ONE_SIDED, NONFINITE, NONPOSITIVE, CONDITION_INELIGIBLE,
      CLOCK_UNAVAILABLE, MODALITY_ABSENT},
     // row EQUAL_TIME_UNORDERED
     {EQUAL_TIME_UNORDERED, EQUAL_TIME_UNORDERED, EQUAL_TIME_UNORDERED, ATTACHMENT_FUTURE,
-     WRONG_CIVIL_DAY, EQUAL_TIME_UNORDERED, LOCKED, CROSSED,
+     WRONG_CIVIL_DAY, STALE_DIAG, LOCKED, CROSSED,
      ONE_SIDED, NONFINITE, NONPOSITIVE, CONDITION_INELIGIBLE,
      CLOCK_UNAVAILABLE, MODALITY_ABSENT},
     // row ATTACHMENT_FUTURE
     {ATTACHMENT_FUTURE, ATTACHMENT_FUTURE, ATTACHMENT_FUTURE, ATTACHMENT_FUTURE,
-     WRONG_CIVIL_DAY, ATTACHMENT_FUTURE, LOCKED, CROSSED,
+     WRONG_CIVIL_DAY, STALE_DIAG, LOCKED, CROSSED,
      ONE_SIDED, NONFINITE, NONPOSITIVE, CONDITION_INELIGIBLE,
      CLOCK_UNAVAILABLE, MODALITY_ABSENT},
     // row WRONG_CIVIL_DAY
     {WRONG_CIVIL_DAY, WRONG_CIVIL_DAY, WRONG_CIVIL_DAY, WRONG_CIVIL_DAY,
-     WRONG_CIVIL_DAY, WRONG_CIVIL_DAY, LOCKED, CROSSED,
+     WRONG_CIVIL_DAY, STALE_DIAG, LOCKED, CROSSED,
      ONE_SIDED, NONFINITE, NONPOSITIVE, CONDITION_INELIGIBLE,
      CLOCK_UNAVAILABLE, MODALITY_ABSENT},
     // row STALE_DIAG
-    {STALE_DIAG, MISSING, EQUAL_TIME_UNORDERED, ATTACHMENT_FUTURE,
-     WRONG_CIVIL_DAY, STALE_DIAG, LOCKED, CROSSED,
+    {STALE_DIAG, STALE_DIAG, STALE_DIAG, STALE_DIAG,
+     STALE_DIAG, STALE_DIAG, LOCKED, CROSSED,
      ONE_SIDED, NONFINITE, NONPOSITIVE, CONDITION_INELIGIBLE,
      CLOCK_UNAVAILABLE, MODALITY_ABSENT},
     // row LOCKED
