engine/cpp/tests/mutants/M202_parquet_validity_inverted.patch
--- a/qr_parquet/src/reader.cpp
+++ b/qr_parquet/src/reader.cpp
@@ -929,7 +929,7 @@
                            static_cast<std::size_t>(first_row) + rows);
   } else {
     for (std::size_t index = 0; index < rows; ++index) {
-      if (levels[index] != 0) {
+      if (levels[index] == 0) {
         out.validity.set(static_cast<std::size_t>(first_row) + index);
       }
     }
