engine/cpp/tests/mutants/M205_parquet_required_gate_opened.patch
--- a/qr_parquet/include/qr_parquet/dialect.hpp
+++ b/qr_parquet/include/qr_parquet/dialect.hpp
@@ -143,7 +143,7 @@
 /// refused separately (a leaf may not have children, and no schema element
 /// below the root may have children).
 [[nodiscard]] constexpr bool is_pinned_repetition(std::int32_t repetition) noexcept {
-  return repetition == kRepetitionOptional;
+  return repetition == kRepetitionOptional || repetition == kRepetitionRequired;
 }
 
 // --- the profile-aware gate ------------------------------------------------
