engine/cpp/tests/mutants/M2503_m25_uniform_stream_drops_the_purpose_word.patch
--- a/qr_m25/src/skill.cpp
+++ b/qr_m25/src/skill.cpp
@@ -157,8 +157,9 @@
 UniformStream::UniformStream(DrawPurpose purpose, std::int64_t session_ordinal,
                              std::int64_t replicate)
     : generator_(qr::replay::SeedSequence::from_entropy(std::vector<std::uint64_t>{
-          qr::replay::kProgramSeed, kM25Tag, static_cast<std::uint64_t>(purpose),
-          static_cast<std::uint64_t>(session_ordinal), static_cast<std::uint64_t>(replicate)})) {}
+          qr::replay::kProgramSeed, kM25Tag, 0 * static_cast<std::uint64_t>(purpose),
+          static_cast<std::uint64_t>(session_ordinal),
+          static_cast<std::uint64_t>(replicate)})) {}  // MUTANT M2503: purpose ignored
 
 double UniformStream::next() noexcept {
   // numpy `random_standard_uniform`: (next_uint64() >> 11) * (1 / 2^53).
