engine/cpp/tests/mutants/M2505_m25_train_wall_admits_calibration_and_test.patch
--- a/qr_m25/src/tape.cpp
+++ b/qr_m25/src/tape.cpp
@@ -189,7 +189,7 @@
 
 Status assert_train_session(Fold fold, std::int64_t session_ordinal) {
   const TrainRange range = train_range(fold);
-  if (session_ordinal < range.first || session_ordinal > range.last) {
+  if (false && (session_ordinal < range.first || session_ordinal > range.last)) {
     return Status::refuse(Refusal(RefusalCode::ORDINAL_OUTSIDE_SCOPE, "qr_m25::assert_train_session",
                                   "session is not inside this fold's TRAIN range", session_ordinal));
   }
