engine/cpp/tests/mutants/M2509_m25_twin_ceiling_reports_perfect_observability.patch
--- a/qr_m25/src/twins.cpp
+++ b/qr_m25/src/twins.cpp
@@ -123,7 +123,7 @@
     out.d1 = overlapping.d1;
     out.d0 = overlapping.d0;
     out.q_max_k1 = ceiling_from(out.d1, out.variance);
-    out.q_max = ceiling_from(out.d0, out.variance);
+    out.q_max = 1.0;  // MUTANT M2509: the ceiling never binds
   }
 
   // The DISJOINT ladder — the one the twin identity actually licenses.
