engine/cpp/tests/mutants/M2510_m25_twin_ceiling_uses_every_pair_of_the_cell.patch
--- a/qr_m25/src/twins.cpp
+++ b/qr_m25/src/twins.cpp
@@ -115,7 +115,10 @@
   // The OVERLAP-PERMITTING ladder (reported, biased upwards — see the header).
   std::array<double, kTwinLadderDepth> gap_sq{};
   for (std::size_t k = 0; k < kTwinLadderDepth; ++k) {
-    gap_sq[k] = accumulator.gap_sq_sum[k][horizon_index];
+    // MUTANT M2510: the nearest neighbour is replaced by the whole cell
+    gap_sq[k] = accumulator.all_gap_sq_sum[horizon_index] *
+                static_cast<double>(accumulator.pair_count[k]) /
+                static_cast<double>(std::max<std::int64_t>(accumulator.all_pair_count, 1));
   }
   const LadderFit overlapping =
       fit_ladder(accumulator.pair_count, accumulator.distance_sum, gap_sq);
