engine/cpp/tests/mutants/M2515_m25_card_sha_is_not_read_from_the_shard.patch
--- a/qr_m25/src/tape.cpp
+++ b/qr_m25/src/tape.cpp
@@ -211,7 +211,7 @@
                                         "shard manifest carries no task_card_v4 census row",
                                         session_ordinal));
   }
-  return manifest.value().card_sha256;
+  return std::string(64, '0');  // MUTANT M2515: a constant, not the shard's census
 }
 
 Expected<SessionTape, Refusal> load_session(const TapeRoot& root, Fold fold,
