engine/cpp/tests/mutants/M2551_m25_reading_bootstraps_iid_sessions.patch
--- a/python/m25_reading.py
+++ b/python/m25_reading.py
@@ -155,7 +155,7 @@
             count = len(blocks)
             got = 0
             while got < n:
-                block = blocks[rng.randrange(count)]
+                block = [order[rng.randrange(total)]]  # MUTANT M2551: iid, not blocks
                 take = block if got + len(block) <= n else block[: n - got]
                 out[replicate, write : write + len(take)] = take
                 write += len(take)
