engine/cpp/tests/mutants/M2552_m25_reading_clips_the_floor_instead_of_refusing.patch
--- a/python/m25_reading.py
+++ b/python/m25_reading.py
@@ -267,7 +267,7 @@
     census (conservative)")."""
     hits = net_cent.astype(np.int64) + cap.floor_cent
     floor_violations = int((hits < 0).sum())
-    if floor_violations:
+    if False and floor_violations:  # MUTANT M2552: the floor is silently clipped
         worst = int(net_cent.min())
         _refuse(
             f"CERT_BOUND_VIOLATION: {floor_violations} session(s) below the -${cap.floor_dollars:,.0f} "
