engine/cpp/tests/mutants/M2560_m25_twin_ceiling_skips_the_extrapolation.patch
--- a/python/m25_reading.py
+++ b/python/m25_reading.py
@@ -483,7 +483,7 @@
         if abs(denominator) > 0.0:
             beta = (w * sxy - sx * sy) / denominator
             d0 = (sy - beta * sx) / w
-    return d1, min(max(d0, 0.0), d1), int(pairs_k1)
+    return d1, 0.0, int(pairs_k1)  # MUTANT M2560: the ceiling is always perfect
 
 
 def twin_ceiling(entry: Dict[str, float]) -> Ceiling:
