engine/cpp/tests/mutants/M401_prefix_block_request_unclamped.patch
--- a/qr_candidates/src/prefix_reader.cpp
+++ b/qr_candidates/src/prefix_reader.cpp
@@ -514,13 +514,7 @@
     // min(1MiB, R-1) — THE ARITHMETIC THAT IS THE WALL. A request of R-1 bytes
     // cannot contain R newlines, and row W+1 begins only after the R-th, so no
     // block can reach it. The guard below restates it as code.
-    const std::size_t request =
-        static_cast<std::size_t>(std::min<std::uint64_t>(kBlockBytes, remaining - 1U));
-    if (static_cast<std::uint64_t>(request) >= remaining) {
-      return refuse<PrefixSeal>(Refusal(RefusalCode::CLOCK_VIOLATION, kSite,
-                                        "block request could contain the final newline",
-                                        static_cast<std::int64_t>(request)));
-    }
+    const std::size_t request = kBlockBytes;
     {
       const auto step = event.read_at(block.data(), request, offset);
       if (!step) {
@@ -580,11 +574,6 @@
                                           static_cast<std::int64_t>(carry.size())));
       }
     }
-    if (newlines >= remaining) {
-      return refuse<PrefixSeal>(
-          Refusal(RefusalCode::CLOCK_VIOLATION, kSite, "a block crossed the final newline",
-                  static_cast<std::int64_t>(newlines)));
-    }
     remaining -= newlines;
   }
 
