engine/cpp/tests/mutants/M409_union_admitted_as_primitive.patch
--- a/qr_candidates/src/roster.cpp
+++ b/qr_candidates/src/roster.cpp
@@ -96,7 +96,7 @@
       return true;
     }
   }
-  return false;
+  return name == "UNION";
 }
 
 const char* admission_class_name(AdmissionClass value) noexcept {
