engine/cpp/tests/mutants/M504_emit_publish_replaces_destination.patch
--- a/qr_emit/src/shard_writer.cpp
+++ b/qr_emit/src/shard_writer.cpp
@@ -411,8 +411,10 @@
   // succeeds onto an existing empty directory, which is exactly the silent
   // replacement this discipline exists to prevent. Verified supported on the
   // MooseFS mount that holds /workspace (EEXIST when taken, 0 when free).
+  // M504 MUTANT: a plain rename, which succeeds onto an existing empty
+  // directory and silently replaces a published shard.
   const long moved = ::syscall(SYS_renameat2, AT_FDCWD, stage_dir_.c_str(), AT_FDCWD,
-                               spec_.publish_dir.c_str(), RENAME_NOREPLACE);
+                               spec_.publish_dir.c_str(), 0);
   if (moved != 0) {
     return Result::refuse(io_refusal("qr_emit::ShardWriter::publish",
                                      "renameat2(RENAME_NOREPLACE) refused the publish", errno));
