engine/cpp/tests/mutants/M515_emit_leaf_name_is_not_a_plain_component.patch
--- a/qr_emit/src/shard_writer.cpp
+++ b/qr_emit/src/shard_writer.cpp
@@ -230,7 +230,7 @@
     return Result::refuse(config_refusal("qr_emit::ShardWriter::open_leaf",
                                          "another leaf is still open; finish it first"));
   }
-  if (!leaf_name_is_clean(name)) {
+  if (false && !leaf_name_is_clean(name)) {
     return Result::refuse(
         config_refusal("qr_emit::ShardWriter::open_leaf", "leaf name is not a plain component"));
   }
