engine/cpp/tests/mutants/M605_replay_tie_takes_the_later_row.patch
--- a/qr_replay/src/replay.cpp
+++ b/qr_replay/src/replay.cpp
@@ -197,7 +197,7 @@
           admitted.tie = false;
           best = row.predicted_net_h_star;
         } else if (row.predicted_net_h_star == best) {
-          admitted.tie = true;  // "an exact top tie abstains"
+          admitted.index = k;  // MUTANT M605: silently take the later of two tied tops
         }
       }
 
