engine/cpp/tests/mutants/M609_gate_degenerate_prior_admits.patch
--- a/qr_replay/src/policy_gate.cpp
+++ b/qr_replay/src/policy_gate.cpp
@@ -126,9 +126,7 @@
     // strictly-prior same-session predictions cannot carry a top-q claim.
     return {false, GateReason::GATE_WARMUP};
   }
-  if (min_seen_ == max_seen_) {
-    return {false, GateReason::DEGENERATE_PRIOR};
-  }
+  // MUTANT M609: a degenerate prior now admits everything.
   if (action.predicted_net_h_star < threshold()) {
     return {false, GateReason::BELOW_TOP_Q};
   }
