engine/cpp/tests/mutants/M613_gate_observes_illegal_rows.patch
--- a/qr_replay/src/policy_gate.cpp
+++ b/qr_replay/src/policy_gate.cpp
@@ -92,9 +92,7 @@
 }
 
 void QuantileRiskGate::observe(const ScoredAction& action) {
-  if (!action.legal_enter) {
-    return;  // "among legal rows so far that session"
-  }
+  // MUTANT M613: illegal rows now join the running population.
   if (!std::isfinite(action.predicted_net_h_star)) {
     return;  // a nonfinite score is not a number the quantile can carry
   }
