engine/cpp/tests/mutants/M619_gate_warmup_floor_removed.patch
--- a/qr_replay/src/policy_gate.cpp
+++ b/qr_replay/src/policy_gate.cpp
@@ -121,11 +121,7 @@
   if (!std::isfinite(action.predicted_net_h_star) || !std::isfinite(action.predicted_stop_prob_h_ref)) {
     return {false, GateReason::NONFINITE_SCORE};
   }
-  if (!is_warm()) {
-    // The preregistered warm-up floor: fewer than kGateWarmupMinimum
-    // strictly-prior same-session predictions cannot carry a top-q claim.
-    return {false, GateReason::GATE_WARMUP};
-  }
+  // MUTANT M619: the preregistered warm-up floor is gone.
   if (min_seen_ == max_seen_) {
     return {false, GateReason::DEGENERATE_PRIOR};
   }
