engine/cpp/tests/mutants/M806_labels_certificate_rescans_its_own_wall.patch
--- a/qr_labels/src/label_kernel.cpp
+++ b/qr_labels/src/label_kernel.cpp
@@ -381,7 +381,15 @@
   // --- the co-primary certificate ------------------------------------------
   // "the uncapped best positive executable mark BEFORE the first net
   // -30,000-cent adverse wall, otherwise the wall or final eligible group".
-  const std::int64_t window_hi = row.scan.crossed ? row.scan.crossing_index - 1 : last;
+  // MUTANT M806: the certificate no longer consumes THE shared scan; it
+  // re-derives a wall of its own, four cents away.
+  const Expected<StopScan, Refusal> own_scan =
+      stop_scan(index, entry_index, entry_u6, side, wall_net_cent + 4);
+  if (!own_scan.has_value()) {
+    return Expected<LabelRow, Refusal>::refuse(own_scan.error());
+  }
+  const std::int64_t window_hi =
+      own_scan.value().crossed ? own_scan.value().crossing_index - 1 : last;
   std::int64_t certificate_index = kNoIndex;
   if (entry_index + 1 <= window_hi) {
     const std::int64_t best = best_adverse_index(index.adverse(side), entry_index + 1, window_hi,
@@ -399,8 +407,9 @@
     // No positive pre-wall mark: the wall if there is one, else the final
     // lawful mark. "Never exit at entry merely because entry is maximum" is
     // structural here — the search never includes the entry group.
-    certificate_index = row.scan.crossed
-                            ? (row.scan.exit_index != kNoIndex ? row.scan.exit_index : last)
+    certificate_index = own_scan.value().crossed
+                            ? (own_scan.value().exit_index != kNoIndex ? own_scan.value().exit_index
+                                                                       : last)
                             : last;
   }
   const Expected<std::int64_t, Refusal> certificate_net =
