engine/cpp/tests/mutants/M901_census_equal_time_run_is_not_canonicalised.patch
--- a/qr_census/src/differential.cpp
+++ b/qr_census/src/differential.cpp
@@ -323,9 +323,9 @@
     std::iota(order_.begin(), order_.end(), std::size_t{0});
     const std::uint8_t* base = run_.data();
     const std::size_t width = width_;
-    std::sort(order_.begin(), order_.end(), [base, width](std::size_t left, std::size_t right) {
-      return std::memcmp(base + (left * width), base + (right * width), width) < 0;
-    });
+    // M901: the run keeps whatever order the vendor happened to write.
+    (void)base;
+    (void)width;
     for (const std::size_t index : order_) {
       const std::uint8_t* image = run_.data() + (index * width_);
       pending_.insert(pending_.end(), image, image + width_);
