engine/cpp/tests/mutants/M912_census_registry_oracle_never_compares.patch
--- a/qr_census/src/verdict.cpp
+++ b/qr_census/src/verdict.cpp
@@ -433,8 +433,7 @@
                       measured.empty() ? "ABSENT" : measured, Verdict::FAIL);
           continue;
         }
-        builder.add(std::move(field), oracle, measured,
-                    oracle == measured ? Verdict::PASS : Verdict::FAIL);
+        builder.add(std::move(field), oracle, measured, Verdict::PASS);  // M912
       }
     }
   }
