engine/cpp/tests/mutants/M919_census_agreeing_rows_are_reported_as_fail.patch
--- a/qr_census/src/verdict.cpp
+++ b/qr_census/src/verdict.cpp
@@ -475,8 +475,7 @@
         pair.have_cpp_total = as_i64(lhs.value, pair.cpp_total);
         pair.have_rust_total = as_i64(rhs.value, pair.rust_total);
       } else {
-        builder.add(field_of(lhs), rhs.value, lhs.value,
-                    lhs.value == rhs.value ? Verdict::PASS : Verdict::FAIL);
+        builder.add(field_of(lhs), rhs.value, lhs.value, Verdict::FAIL);  // M919
       }
       ++li;
       ++ri;
