engine/cpp/tests/mutants/M956_trainer_truth_allowlist_is_widened.patch
--- a/python/campaign/synth.py
+++ b/python/campaign/synth.py
@@ -57,6 +57,8 @@
 # The trainer's explicit truth allowlist.  §3: "the trainer opens an explicit
 # truth allowlist for loss computation only".  NEVER widen this list.
 TRUTH_ALLOWLIST = (
+    "menu_mae_cent",   # M956 MUTANT: leaves the loss does not need
+    "menu_exit_ts",
     "menu_net_cent",
     "cert_net_cent",
     "stop_hit",
