engine/cpp/tests/mutants/MA22_carriers_scalar_mean_rounds_instead_of_truncating.patch
--- a/qr_carriers/include/qr_carriers/prior_state.hpp
+++ b/qr_carriers/include/qr_carriers/prior_state.hpp
@@ -94,7 +94,8 @@
     if (count <= 0) {
       return Typed<std::int64_t>{0, Validity::MISSING};
     }
-    return Typed<std::int64_t>{sum / count, Validity::VALID};
+    // MA22: the group mean rounds instead of truncating once at the accessor.
+    return Typed<std::int64_t>{(sum + count / 2) / count, Validity::VALID};
   }
 };
 
