engine/cpp/tests/mutants/MA23_carriers_scalar_accumulator_keeps_only_the_last_member.patch
--- a/qr_carriers/include/qr_carriers/prior_state.hpp
+++ b/qr_carriers/include/qr_carriers/prior_state.hpp
@@ -80,12 +80,10 @@
   }
 
   [[nodiscard]] bool add(std::int64_t value) noexcept {
-    const auto next = checked_add(sum, value);
-    if (!next.has_value()) {
-      return false;
-    }
-    sum = next.value();
-    ++count;
+    // MA23: the reduction becomes LAST-MEMBER-WINS, so it depends on the order
+    // the members happened to arrive in.
+    sum = value;
+    count = 1;
     return true;
   }
 
