engine/cpp/tests/mutants/MA26_carriers_nbbo_prior_commits_for_every_group.patch
--- a/qr_carriers/include/qr_carriers/prior_state.hpp
+++ b/qr_carriers/include/qr_carriers/prior_state.hpp
@@ -208,9 +208,8 @@
            pending_.bid_shares.add(bid_shares) && pending_.ask_shares.add(ask_shares);
   }
   void commit_group() noexcept {
-    if (pending_.eligible_count() > 0) {
-      prior_ = NbboPrior{true, pending_ts_ns_a_, pending_};
-    }
+    // MA26: a group with no ELIGIBLE member still replaces the frozen prior.
+    prior_ = NbboPrior{true, pending_ts_ns_a_, pending_};
     pending_.reset();
   }
   [[nodiscard]] const NbboPrior& prior() const noexcept { return prior_; }
