engine/cpp/tests/mutants/MA27_carriers_contract_identity_drops_the_right.patch
--- a/qr_carriers/include/qr_carriers/prior_state.hpp
+++ b/qr_carriers/include/qr_carriers/prior_state.hpp
@@ -240,10 +240,9 @@
     if (lhs.expiration_day != rhs.expiration_day) {
       return lhs.expiration_day < rhs.expiration_day;
     }
-    if (lhs.strike_u6 != rhs.strike_u6) {
-      return lhs.strike_u6 < rhs.strike_u6;
-    }
-    return static_cast<std::uint8_t>(lhs.right) < static_cast<std::uint8_t>(rhs.right);
+    // MA27: the "exact option contract" stops including the right, so a call
+    // and a put at the same strike share one prior.
+    return lhs.strike_u6 < rhs.strike_u6;
   }
   friend bool operator==(const ContractKey& lhs, const ContractKey& rhs) noexcept {
     return lhs.expiration_day == rhs.expiration_day && lhs.strike_u6 == rhs.strike_u6 &&
