engine/cpp/tests/mutants/MA37_carriers_prefix_endpoint_drops_the_cutoff_second.patch
--- a/qr_carriers/src/grid_1s.cpp
+++ b/qr_carriers/src/grid_1s.cpp
@@ -66,7 +66,8 @@
   if (static_cast<std::size_t>(index) + 1U >= points_.size()) {
     return std::nullopt;
   }
-  return static_cast<std::size_t>(index);
+  // MA37: the complete second ENDING at the cutoff is thrown away.
+  return static_cast<std::size_t>(index > 0 ? index - 1 : index);
 }
 
 Typed<double> MidpointGrid::realized_volatility(std::size_t endpoint_index,
