engine/cpp/tests/mutants/MA40_carriers_moments_admit_missing_and_nonfinite_values.patch
--- a/qr_carriers/src/normalization.cpp
+++ b/qr_carriers/src/normalization.cpp
@@ -28,8 +28,9 @@
 }  // namespace
 
 void SessionMoments::observe(double value) noexcept {
-  if (!std::isfinite(value)) {
-    return;  // "use only finite present values"
+  // MA40: "use only finite present values" is dropped.
+  if (false) {
+    return;
   }
   sum += value;
   sum_squares += value * value;
@@ -37,9 +38,7 @@
 }
 
 void SessionMoments::observe_typed(double value, Validity validity) noexcept {
-  if (validity != Validity::VALID) {
-    return;
-  }
+  (void)validity;  // MA40
   observe(value);
 }
 
