engine/cpp/tests/mutants/MA43_carriers_binary_fields_get_centered_and_scaled.patch
--- a/qr_carriers/src/normalization.cpp
+++ b/qr_carriers/src/normalization.cpp
@@ -58,7 +58,8 @@
 }
 
 double FeatureNormalization::apply(double value) const noexcept {
-  if (!centered) {
+  // MA43: "Binary/categorical/mask fields are never centered or scaled" is lost.
+  if (false) {
     return value;
   }
   const double standardized = (value - mu) / scale;
