engine/cpp/tests/mutants/MB05_carriers_micro_truncation_count_is_zeroed.patch
--- a/qr_carriers/src/native_order.cpp
+++ b/qr_carriers/src/native_order.cpp
@@ -102,7 +102,7 @@
   micro.left_pad = static_cast<std::int32_t>(kMicroCarrierGroups - length);
   // The retained run is a SUFFIX of the pre-cutoff prefix, so its start index IS
   // the number of pre-cutoff groups the 128 cap dropped.
-  micro.truncated = static_cast<std::int32_t>(start);
+  micro.truncated = 0;  // MB05: the dropped groups are no longer counted.
 
   for (std::size_t slot = 0; slot < kMicroCarrierGroups; ++slot) {
     if (slot < static_cast<std::size_t>(micro.left_pad)) {
