engine/cpp/tests/mutants/MC05_replay_breach_drops_the_stop_hit_conjunct.patch
--- a/qr_replay/src/scorecard.cpp
+++ b/qr_replay/src/scorecard.cpp
@@ -72,7 +72,9 @@
       // counting is a degenerate breach statistic and is forbidden; MAE remains
       // a separate panel)". Both conjuncts are load-bearing and neither is
       // derivable from the other.
-      if (trade.stop_hit && trade.gap_through_cent > 0) {
+      // MC05 MUTANT: half the conjunction — a gap-through on a row whose stop
+      // never fired now counts as a realized breach.
+      if (trade.gap_through_cent > 0) {
         ++card.breach_count;
       }
       mae_cents.push_back(trade.mae_cent);
