engine/cpp/tests/mutants/MC08_candidates_scorable_cell_compared_to_the_literal_true.patch
--- a/qr_candidates/src/roster.cpp
+++ b/qr_candidates/src/roster.cpp
@@ -321,14 +321,11 @@
     // the publication's vocabulary would silently shrink the population instead
     // of stopping the run. A null is refused for the same reason: an absent
     // scorability is not a false one.
-    if (registry.is_null(reg_scorable.value(), row)) {
-      return refuse<SessionRoster>(
-          Refusal(RefusalCode::DECODE_FAILED, kSite, "event_scorable is null", row));
-    }
-    const auto scorable = parse_bool(registry.value(reg_scorable.value(), row), kSite);
-    if (!scorable) {
-      return refuse<SessionRoster>(scorable.error());
-    }
+    // MC08 MUTANT: the loose comparison, restored. `TRUE`, `1` and every other
+    // spelling read as "not scorable" and the candidate leaves the population.
+    const Expected<bool, Refusal> scorable =
+        !registry.is_null(reg_scorable.value(), row) &&
+        registry.value(reg_scorable.value(), row) == "true";
     const bool has_visibility = !registry.is_null(reg_visible.value(), row) &&
                                 registry.value(reg_visible.value(), row) != kAbsentCell;
     const AdmissionClass admission =
