engine/cpp/tests/mutants/MC21_checker_suppression_swallows_every_violation_in_the_file.patch
--- a/python/check_truth_separation.py
+++ b/python/check_truth_separation.py
@@ -232,7 +232,8 @@
     for violation in violations:
         parts = violation.split(":", 2)
         number = int(parts[1]) if len(parts) > 1 and parts[1].isdigit() else 0
-        source = lines[number - 1] if 1 <= number <= len(lines) else ""
+        # MC21 MUTANT: the marker suppresses the whole FILE, not its own line.
+        source = text
         if SUPPRESSION in source:
             dropped += 1
             continue
