engine/cpp/tests/mutants/MD02_campaign_ordinal_wall_admits_everything_nonnegative.patch
--- a/qr_campaign/src/driver.cpp
+++ b/qr_campaign/src/driver.cpp
@@ -320,7 +320,9 @@
 // ---------------------------------------------------------------------------
 
 Status refuse_unless_in_scope(std::int64_t ordinal) {
-  if (ordinal < kFirstScopedOrdinal || ordinal > kLastScopedOrdinal) {
+  // MD02: the 125..749 wall is widened to "any nonnegative ordinal", which is
+  // the fail-open that lets fold-6/7 and the 2025 era boundaries through.
+  if (ordinal < 0) {
     return Status::refuse(Refusal(RefusalCode::ORDINAL_OUTSIDE_SCOPE, kSite,
                                   "card §1 as amended 2026-08-12-c: only sessions 125..917 are admissible, and the "
                                   "wall is applied before any path is formed",
