engine/cpp/tests/mutants/MD04_campaign_plan_ignores_already_published_shards.patch
--- a/qr_campaign/src/driver.cpp
+++ b/qr_campaign/src/driver.cpp
@@ -248,7 +248,10 @@
     SessionTask task;
     task.ordinal = ordinal;
     for (const qr::emit::Side side : {qr::emit::Side::LONG, qr::emit::Side::SHORT}) {
-      const bool published = side_is_published(layout, ordinal, side);
+      // MD04: the plan never looks at what is already published, so resume
+      // rebuilds a published shard and a fresh run walks into the no-replace
+      // rename instead of refusing early.
+      const bool published = side_is_published(layout, ordinal, side) && false;
       if (!published) {
         continue;
       }
