engine/cpp/tests/mutants/MD05_campaign_ledger_merges_in_completion_order.patch
--- a/qr_campaign/src/driver.cpp
+++ b/qr_campaign/src/driver.cpp
@@ -641,9 +641,10 @@
 Expected<std::string, Refusal> render_campaign_receipt(const RunLayout& layout,
                                                        std::span<const std::int64_t> ordinals) {
   using Result = Expected<std::string, Refusal>;
+  // MD05: the campaign receipt is assembled in the order the sessions were
+  // handed in — i.e. in COMPLETION order — so the published bytes move with
+  // the worker count.
   std::vector<std::int64_t> sorted(ordinals.begin(), ordinals.end());
-  std::sort(sorted.begin(), sorted.end());
-  sorted.erase(std::unique(sorted.begin(), sorted.end()), sorted.end());
 
   if (layout.card_sha256.empty()) {
     // Never name a card nobody verified: an unbound layout means the spec gate
