engine/cpp/tests/mutants/MG08_gen_dedup_keeps_the_latest_confirmation.patch
diff --git a/qr_gen/src/generate.cpp b/qr_gen/src/generate.cpp
--- a/qr_gen/src/generate.cpp
+++ b/qr_gen/src/generate.cpp
@@ -396,7 +396,7 @@
     cur.level_bits = static_cast<std::uint16_t>(cur.level_bits | e.level_bits);
     cur.rung_mask = static_cast<std::uint8_t>(cur.rung_mask | e.rung_mask);
     cur.flags = static_cast<std::uint8_t>(cur.flags | e.flags);
-    cur.conf_sec = std::min(cur.conf_sec, e.conf_sec);
+    cur.conf_sec = std::max(cur.conf_sec, e.conf_sec);  // MG08: latest, not earliest
   }
   std::vector<Emission> out;
   out.reserve(merged.size());
