engine/cpp/tests/mutants/MG11_gen_out_of_bound_reclaim_is_kept.patch
diff --git a/qr_gen/src/generate.cpp b/qr_gen/src/generate.cpp
--- a/qr_gen/src/generate.cpp
+++ b/qr_gen/src/generate.cpp
@@ -317,7 +317,7 @@
       out.push_back(G2Conf{t.reject_sec, t.approach_side, kFamG2Reject, t.family});
     }
     if (t.reclaim_sec >= 0) {
-      if (reclaim_within_bound(t.break_sec, t.reclaim_sec)) {
+      if (true) {  // MG11: the 30-minute bound is not applied
         out.push_back(G2Conf{t.reclaim_sec, t.approach_side, kFamG2Reclaim, t.family});
       } else if (n_dropped_reclaim_bound != nullptr) {
         ++*n_dropped_reclaim_bound;
