engine/cpp/tests/mutants/MG12_gen_g2_uses_the_fast_open_delay.patch
diff --git a/qr_gen/src/generate.cpp b/qr_gen/src/generate.cpp
--- a/qr_gen/src/generate.cpp
+++ b/qr_gen/src/generate.cpp
@@ -333,7 +333,8 @@
   for (const G2Conf& c : g2) {
     const std::uint16_t lvl = static_cast<std::uint16_t>(1u << static_cast<unsigned>(c.family));
     // CC-M1-5 D14: G2 keeps tau* everywhere; only G1 has a FAST-OPEN delay.
-    out.push_back(Emission{c.conf_sec + kTauStar, c.side, c.fam_bit, lvl, 0, c.conf_sec, 0});
+    out.push_back(Emission{c.conf_sec + kFastOpenDelay, c.side, c.fam_bit, lvl, 0,
+                           c.conf_sec, 0});  // MG12: G2 must keep tau*
   }
   return out;
 }
