engine/cpp/tests/mutants/MG13_gen_level_arms_after_a_single_far_second.patch
diff --git a/qr_gen/include/qr_gen/levels.hpp b/qr_gen/include/qr_gen/levels.hpp
--- a/qr_gen/include/qr_gen/levels.hpp
+++ b/qr_gen/include/qr_gen/levels.hpp
@@ -80,7 +80,7 @@
 [[nodiscard]] std::vector<std::pair<int, int>> orext_adopted_cells(qr::futsess::Asset asset);
 
 // --- §4 / §6 state-machine constants ---------------------------------------
-inline constexpr std::int32_t kArmSeconds = 300;
+inline constexpr std::int32_t kArmSeconds = 1;  // MG13
 inline constexpr double kArmDistanceMult = 2.0;
 inline constexpr double kTolTicks = 2.0;
 inline constexpr double kTolAtrFrac = 0.05;
