engine/cpp/tests/mutants/MG16_gen_pre_creation_seconds_are_visible.patch
diff --git a/qr_gen/src/levels.cpp b/qr_gen/src/levels.cpp
index bd37857..7ced2b9 100644
--- a/qr_gen/src/levels.cpp
+++ b/qr_gen/src/levels.cpp
@@ -332,7 +332,7 @@ TouchScan touch_scan(const std::vector<double>& dist, const std::vector<std::int
   for (std::int64_t k = 0; k < n; ++k) {
     const double d = dist[static_cast<std::size_t>(k)];
     const bool finite = std::isfinite(d);
-    const bool is_near = (k >= active_from) && finite && (d <= tol);
+    const bool is_near = finite && (d <= tol);  // MG16: creation ignored
     const bool is_far = (k >= active_from) && finite && (d > far_tol);
     run_far = is_far ? run_far + 1 : 0;
     bool armable = (run_far >= kArmSeconds);
