engine/cpp/tests/mutants/MG23_gen_kept_family_bit_order_is_swapped.patch
diff --git a/qr_gen/include/qr_gen/levels.hpp b/qr_gen/include/qr_gen/levels.hpp
--- a/qr_gen/include/qr_gen/levels.hpp
+++ b/qr_gen/include/qr_gen/levels.hpp
@@ -63,8 +63,8 @@
 /// (b10_generation_v3.KEPT_LEVEL_FAMILIES = b8's six, then OR_EXT APPENDED —
 /// appended, so every bit the v2 roster ever wrote keeps its meaning).
 enum class LevelFamily : std::uint8_t {
-  FVOL_LADDER = 0,
-  FVOL_BAND = 1,
+  FVOL_LADDER = 1,  // MG23: the roster's bit order is not this
+  FVOL_BAND = 0,
   NDAY = 2,
   PRIOR_DAY = 3,
   PHASE_HL = 4,
