engine/cpp/tests/mutants/MG27_gen_spec_pin_is_declared_but_stale.patch
diff --git a/qr_gen/src/generate.cpp b/qr_gen/src/generate.cpp
--- a/qr_gen/src/generate.cpp
+++ b/qr_gen/src/generate.cpp
@@ -23,7 +23,7 @@
 
 /// The frozen specs this engine implements. A pin nobody checks is decoration:
 /// the test suite recomputes both from the files.
-constexpr const char* kSpecM1bSha16 = "d31f48b59877e44d";
+constexpr const char* kSpecM1bSha16 = "0000000000000000";  // MG27: never checked
 // CC-M1-6.4 (the twice-bitten lesson): a CC amendment to a spec MUST bump the
 // code sha pins in the SAME commit. CC-M1-6..9 were appended to PORT_M1_SPEC.md
 // without the bump, which left this pin stale and the pin test RED at HEAD;
