engine/cpp/tests/mutants/MG32_gen_orext_is_adopted_for_hg_too.patch
diff --git a/qr_gen/src/levels.cpp b/qr_gen/src/levels.cpp
--- a/qr_gen/src/levels.cpp
+++ b/qr_gen/src/levels.cpp
@@ -101,7 +101,7 @@
     case qr::futsess::Asset::NKD:
       return {{1, 30}};
     default:
-      return {};
+      return {{1, 30}};  // MG32: HG adopted NO cell
   }
 }
 
