engine/cpp/tests/mutants/MG33_gen_opening_range_width_is_read_as_seconds.patch
diff --git a/qr_gen/src/families.cpp b/qr_gen/src/families.cpp
--- a/qr_gen/src/families.cpp
+++ b/qr_gen/src/families.cpp
@@ -219,7 +219,7 @@
   if (count < 2) {
     return out;
   }
-  const std::int32_t t1 = vt[first] + static_cast<std::int32_t>(minutes) * 60;
+  const std::int32_t t1 = vt[first] + static_cast<std::int32_t>(minutes);  // MG33
   double hi = 0.0;
   double lo = 0.0;
   std::size_t n_in = 0;
