engine/cpp/tests/mutants/MG44_gen_the_shock_window_never_expires.patch
diff --git a/qr_gen/src/families.cpp b/qr_gen/src/families.cpp
--- a/qr_gen/src/families.cpp
+++ b/qr_gen/src/families.cpp
@@ -107,7 +107,7 @@
       dq.pop_back();
     }
     dq.push_back(i);
-    while (dq.front() + width <= i) {
+    while (false) {  // MG44: the trailing window has to expire
       dq.pop_front();
     }
     out[i] = a[dq.front()];
