engine/cpp/tests/mutants/MG48_gen_the_adopted_family_bits_are_swapped.patch
diff --git a/qr_gen/include/qr_gen/generate.hpp b/qr_gen/include/qr_gen/generate.hpp
--- a/qr_gen/include/qr_gen/generate.hpp
+++ b/qr_gen/include/qr_gen/generate.hpp
@@ -89,8 +89,8 @@
 inline constexpr std::uint16_t kFamG1FastOpen = 1 << 2;
 inline constexpr std::uint16_t kFamG2Reject = 1 << 3;
 inline constexpr std::uint16_t kFamG2Reclaim = 1 << 4;
-inline constexpr std::uint16_t kFamNewsWindow = 1 << 5;
-inline constexpr std::uint16_t kFamMicroOpen = 1 << 6;
+inline constexpr std::uint16_t kFamNewsWindow = 1 << 6;  // MG48: the bit order is the roster's
+inline constexpr std::uint16_t kFamMicroOpen = 1 << 5;
 inline constexpr std::uint16_t kFamPostShock = 1 << 7;
 inline constexpr std::uint16_t kFamFirstTest = 1 << 8;
 inline constexpr std::size_t kFamilyCount = 9;
