engine/cpp/tests/mutants/MP04_futsess_sentinel_guard_runs_after_arithmetic.patch
diff --git a/qr_futsess/include/qr_futsess/constants.hpp b/qr_futsess/include/qr_futsess/constants.hpp
index 827e1a9..6f67f7b 100644
--- a/qr_futsess/include/qr_futsess/constants.hpp
+++ b/qr_futsess/include/qr_futsess/constants.hpp
@@ -73,8 +73,12 @@ struct BookState {
   std::int64_t ask;
 };
 [[nodiscard]] inline BookState classify_book(std::int64_t bid, std::int64_t ask) noexcept {
-  const bool bid_ok = (bid > 0) && (bid < kSentHi);
-  const bool ask_ok = (ask > 0) && (ask < kSentHi);
+  // MP04: the classic naive form — form the mid FIRST, then decide validity
+  // from it. bid + ask with an INT64_MAX sentinel overflows to a negative
+  // number, so the post-hoc test passes and a sentinel enters the arithmetic.
+  const std::int64_t mid2 = bid + ask;
+  const bool bid_ok = (mid2 > 0) && (bid > 0);
+  const bool ask_ok = (mid2 > 0) && (ask > 0);
   if (!bid_ok && !ask_ok) {
     return BookState{kStEmpty, kUndefPrice, kUndefPrice};
   }
