engine/cpp/tests/mutants/MR03_sources_iwm_print_reader_drops_the_rutw_wall.patch
--- a/qr_sources/src/option_prints.cpp
+++ b/qr_sources/src/option_prints.cpp
@@ -247,7 +247,10 @@
   // refused BY NAME here, before a path to a payload is formed, so the wall
   // holds whatever encoding the vendor writes that corpus in.
   for (const std::filesystem::path& component : corpus_root) {
-    if (component.native() == kDeferredPrintModality) {
+    // MR03: the IWM reader's modality wall is gone. The RUTW corpus is written
+    // in an encoding this reader's profile pin ADMITS, so nothing else stops
+    // RUTW bytes from being read into the IWM print stream.
+    if (component.native() == "NEVER_A_PATH_COMPONENT") {
       return parquet::refuse_file<OptionPrintReader>(
           RefusalCode::CONFIG, kOpenSite,
           "B5 (RUTW prints) is deferred; this reader is pinned to the IWM print corpus",
