engine/cpp/tests/mutants/MS05_skel_losing_barrier_time_is_discarded.patch
diff --git a/qr_skel/src/query.cpp b/qr_skel/src/query.cpp
--- a/qr_skel/src/query.cpp
+++ b/qr_skel/src/query.cpp
@@ -20,6 +20,10 @@
   if (o.up_hit && o.dn_hit) {
     // CONV C10 / ATLAS §4.3 A2: a simultaneous touch resolves ADVERSE.
     o.winner = (o.tau_up_sec < o.tau_dn_sec) ? BarrierWinner::kFavorable : BarrierWinner::kAdverse;
+    if (o.winner == BarrierWinner::kAdverse) {  // MS05: drop the loser's time
+      o.up_hit = false;
+      o.tau_up_sec = -1;
+    }
   } else if (o.up_hit) {
     o.winner = BarrierWinner::kFavorable;
   } else if (o.dn_hit) {
