engine/cpp/tests/mutants/MV05_ivx_every_populated_column_reads_as_real.patch
--- a/qr_ivx/src/column_census.cpp
+++ b/qr_ivx/src/column_census.cpp
@@ -198,7 +198,7 @@
     return ColumnVerdict::ALL_NULL;
   }
   if (!stat.has_range) {
-    return ColumnVerdict::POPULATED_NO_RANGE;
+    return ColumnVerdict::REAL;
   }
   if (stat.chunks_nonfinite_bound > 0) {
     return ColumnVerdict::REAL_WITH_NONFINITE;
