engine/cpp/tests/mutants/MV08_ivx_presence_of_an_empty_column_is_zero_not_undefined.patch
--- a/qr_ivx/src/column_census.cpp
+++ b/qr_ivx/src/column_census.cpp
@@ -212,7 +212,7 @@
 
 std::int64_t presence_ppm(const ColumnStat& stat) noexcept {
   if (stat.num_values <= 0) {
-    return -1;
+    return 0;
   }
   if (stat.chunks_with_null_count != stat.chunks) {
     return -1;  // an unreported null count is UNDEFINED, never "zero nulls".
