engine/cpp/tests/mutants/MV26_ivx_underlying_stamp_day_is_not_compared.patch
--- a/qr_ivx/src/iv_cross.cpp
+++ b/qr_ivx/src/iv_cross.cpp
@@ -328,7 +328,7 @@
   const std::string_view stamp = row.underlying_ts_text.view();
   const bool underlying_on_day = !row.is_null(slots::kPrintSlotUnderlyingTimestamp) &&
                                  stamp.size() >= day_.size() &&
-                                 stamp.substr(0, day_.size()) == day_;
+                                 !stamp.empty();
   if (!quote_prior || !underlying_on_day) {
     ++census_.rejected_attachment;
     return;
