engine/cpp/tests/mutants/MV30_ivx_iv_velocity_ignores_the_age_gate.patch
--- a/qr_ivx/src/iv_cross.cpp
+++ b/qr_ivx/src/iv_cross.cpp
@@ -397,7 +397,7 @@
   const auto found = last_print_.find(contract);
   if (found != last_print_.end()) {
     const std::int64_t gap_ms = row.ts_ms_b - found->second.ts_ms_b;
-    if (gap_ms > 0 && gap_ms <= kIvVelocityMaxGapMs) {
+    if (gap_ms > 0) {
       const double gap_seconds = static_cast<double>(gap_ms) / 1000.0;
       const double velocity = (row.implied_vol - found->second.iv) / gap_seconds;
       VelocityAccumulator& accumulator = velocity_[window * kBands + band];
