engine/cpp/tests/mutants/MV35_ivx_fd_response_is_a_covariance_not_a_slope.patch
--- a/qr_ivx/src/iv_cross.cpp
+++ b/qr_ivx/src/iv_cross.cpp
@@ -789,7 +789,7 @@
       }
       const double denominator = n * sxx - sx * sx;
       if (std::isfinite(denominator) && denominator != 0.0) {
-        out_window.fd_chi = valid((n * sxy - sx * sy) / denominator);
+        out_window.fd_chi = valid((n * sxy - sx * sy) / (n * n));
       } else {
         out_window.fd_chi = absent(Validity::NONFINITE);
       }
