engine/cpp/tests/mutants/MV43_qskew_reads_the_quote_posted_at_the_boundary.patch
--- a/qr_ivx/src/quote_skew.cpp
+++ b/qr_ivx/src/quote_skew.cpp
@@ -27,7 +27,7 @@
             std::int64_t ts_ms_b, bool present) noexcept {
   if (!present) return false;
   if (bid_u6 <= 0 || ask_u6 <= 0 || bid_u6 > ask_u6) return false;
-  if (ts_ms_b >= boundary_ms) return false;  // STRICTLY prior, never equal
+  if (ts_ms_b > boundary_ms) return false;  // mutant: equal-time is admitted
   return boundary_ms - ts_ms_b <= qr::w21::kContractAgeGateMs;
 }
 
