engine/cpp/tests/mutants/MV47_qskew_breaks_the_atm_tie_on_strike_order.patch
--- a/qr_ivx/src/quote_skew.cpp
+++ b/qr_ivx/src/quote_skew.cpp
@@ -185,7 +185,8 @@
     out.state = Validity::MISSING;
     return out;
   }
-  if (tied) {
+  (void)tied;
+  if (false) {
     out.state = Validity::EQUAL_TIME_UNORDERED;
     return out;
   }
