engine/cpp/tests/mutants/MV55_prints_wall_releases_the_vendor_side_column.patch
--- a/qr_sources/include/qr_sources/stream_spec.hpp
+++ b/qr_sources/include/qr_sources/stream_spec.hpp
@@ -534,7 +534,7 @@
                   ForbiddenColumn{19, ForbidReason::HardRefused},   // lambda
                   ForbiddenColumn{30, ForbidReason::HardRefused},   // d1
                   ForbiddenColumn{31, ForbidReason::HardRefused},   // d2
-                  ForbiddenColumn{38, ForbidReason::HardRefused},   // side
+                  ForbiddenColumn{46, ForbidReason::HardRefused},   // dt_prev_contract_ms
                   ForbiddenColumn{47, ForbidReason::HardRefused},   // sweep_id
                   ForbiddenColumn{48, ForbidReason::HardRefused},   // sweep_n
                   ForbiddenColumn{49, ForbidReason::HardRefused},   // sweep_size
