engine/cpp/tests/mutants/MV64_ivx_fd_ratio_innovation_is_a_level_not_a_change.patch
--- a/qr_ivx/src/iv_cross.cpp
+++ b/qr_ivx/src/iv_cross.cpp
@@ -826,8 +826,7 @@
     // a red-first fixture, `SurfaceDynamics.FdRatioInnovationIsTheWindowToWindowChange`.)
     if (window > 0 && out_window.fd_ratio.v == Validity::VALID &&
         out.window[window - 1].fd_ratio.v == Validity::VALID) {
-      out_window.d_fd_ratio =
-          valid(out_window.fd_ratio.value - out.window[window - 1].fd_ratio.value);
+      out_window.d_fd_ratio = valid(out_window.fd_ratio.value);
     }
 
     // D9: A3 = (E[r_t r_{t+1}^2] - E[r_t^2 r_{t+1}]) / sigma^3, over ADJACENT
