engine/cpp/tests/mutants/MW11_w20_scope_wall_admits_out_of_scope_ordinals.patch
--- a/qr_registry/src/day_scope.cpp
+++ b/qr_registry/src/day_scope.cpp
@@ -14,7 +14,9 @@
 Expected<DayScope, Refusal> DayScope::admit(const Registry& registry, std::int64_t ordinal) {
   // THE WALL, first statement of the function: nothing below runs for an
   // out-of-scope ordinal, and this function has no filesystem argument at all.
-  if (ordinal < kScopeFirstOrdinal || ordinal > kScopeLastOrdinal) {
+  // MW11: the wall is widened past the scope, so the sealed 2025 ordinals
+  // admit and a path can be formed for them.
+  if (ordinal < kScopeFirstOrdinal || ordinal > kScopeLastOrdinal + 200) {
     return Expected<DayScope, Refusal>::refuse(
         Refusal(RefusalCode::ORDINAL_OUTSIDE_SCOPE, kSite,
                 "ordinal outside the scoped calendar 125..917", ordinal));
