engine/cpp/tests/mutants/MX07_wave2_zero_atr_divides_instead_of_typing.patch
--- a/qr_wave2/src/prior_structure.cpp	2026-08-11 12:59:37.000000000 +0000
+++ b/qr_wave2/src/prior_structure.cpp	2026-08-11 12:59:37.000000000 +0000
@@ -14,7 +14,8 @@
 [[nodiscard]] Typed<double> atr_scaled_bps(double sigma, std::int64_t numerator_u6,
                                            std::int64_t denominator_u6, bool atr_present,
                                            double atr14_bps) noexcept {
-  if (!atr_present || !(atr14_bps > 0.0)) {
+  // MX07: a zero ATR is divided by instead of typed.
+  if (!atr_present) {
     // "zero ATR ... => typed with p=0, never clipped".
     return carriers::masked(Validity::MISSING);
   }
