engine/cpp/tests/mutants/MX11_wave2_tau_min_guard_removed.patch
--- a/qr_wave2/src/variance_budget.cpp	2026-08-11 13:00:13.000000000 +0000
+++ b/qr_wave2/src/variance_budget.cpp	2026-08-11 13:00:13.000000000 +0000
@@ -287,7 +287,8 @@
     if (x.v != Validity::VALID || b.v != Validity::VALID) {
       return carriers::masked(Validity::MISSING);
     }
-    if (tau_seconds < kTauMinSeconds) {
+    // MX11: a two-second-old extreme is divided by anyway.
+    if (tau_seconds < 0) {
       return carriers::masked(Validity::MISSING);
     }
     const double denominator = std::sqrt(b.value * static_cast<double>(tau_seconds));
