engine/cpp/tests/mutants/MX14_wave2_cross_session_shuffle_is_dead.patch
--- a/qr_wave2/src/prior_state.cpp	2026-08-11 13:00:45.000000000 +0000
+++ b/qr_wave2/src/prior_state.cpp	2026-08-11 13:00:45.000000000 +0000
@@ -77,7 +77,9 @@
   // A11's cross-session shuffle: the CALLER's fold-scoped map decides which
   // session's priors this position reads. Out-of-range entries are ignored
   // rather than wrapped, so a malformed map cannot silently read the future.
-  if (controls.cross_session_shuffle && position < controls.shuffle_map.size()) {
+  // MX14: the destruction hook never fires, so the control is not a control.
+  if (controls.cross_session_shuffle && position < controls.shuffle_map.size() &&
+      controls.shuffle_map.empty()) {
     const std::int64_t mapped = controls.shuffle_map[position];
     if (mapped >= 0 && static_cast<std::size_t>(mapped) < entries_.size()) {
       return static_cast<std::size_t>(mapped);
