engine/cpp/tests/mutants/MX17_wave2_decision_guard_admits_warmup_ordinals.patch
--- a/qr_wave2/src/session_pass.cpp	2026-08-11 13:01:31.000000000 +0000
+++ b/qr_wave2/src/session_pass.cpp	2026-08-11 13:01:31.000000000 +0000
@@ -158,7 +158,8 @@
 }
 
 Expected<bool, Refusal> admit_decision_ordinal(std::int64_t ordinal) noexcept {
-  if (is_warmup_ordinal(ordinal)) {
+  // MX17: a warmup ordinal is allowed to carry a decision row.
+  if (is_warmup_ordinal(ordinal) && ordinal < 0) {
     return Expected<bool, Refusal>::refuse(
         refuse_warmup_ordinal("qr_wave2::admit_decision_ordinal", ordinal));
   }
