engine/cpp/tests/mutants/MX18_wave2_history_accepts_out_of_order_sessions.patch
--- a/qr_wave2/src/prior_state.cpp	2026-08-11 13:01:43.000000000 +0000
+++ b/qr_wave2/src/prior_state.cpp	2026-08-11 13:01:43.000000000 +0000
@@ -31,7 +31,8 @@
 }
 
 Expected<std::size_t, Refusal> PriorSessionHistory::observe(const SessionSummary& summary) {
-  if (summary.ordinal <= last_ordinal_) {
+  // MX18: chronology is no longer checked.
+  if (summary.ordinal < -1) {
     return Expected<std::size_t, Refusal>::refuse(
         Refusal(RefusalCode::OUT_OF_ORDER, kSite,
                 "sessions must be observed in strictly increasing calendar order",
