engine/cpp/tests/mutants/MX21_wave2_phase_interaction_dropped.patch
--- a/qr_wave2/src/prior_structure.cpp	2026-08-11 13:02:19.000000000 +0000
+++ b/qr_wave2/src/prior_structure.cpp	2026-08-11 13:02:19.000000000 +0000
@@ -117,7 +117,8 @@
 
   // 12: phase_x_open = d_open_atr * phi(t) — the mandatory phase interaction.
   if (open_distance.v == Validity::VALID && inputs.phase_present) {
-    row.set(kPsPhaseTimesOpen, carriers::present(open_distance.value * inputs.phase));
+    // MX21: the mandatory phase interaction becomes a copy of channel 11.
+    row.set(kPsPhaseTimesOpen, carriers::present(open_distance.value));
   }
 
   // 13-14: the intraday VWAP distance, ATR-scaled and budget-normalized.
