engine/cpp/tests/mutants/MX30_wave2_delta_log_b_lag_halved.patch
--- a/qr_wave2/include/qr_wave2/variance_budget.hpp	2026-08-11 13:06:27.000000000 +0000
+++ b/qr_wave2/include/qr_wave2/variance_budget.hpp	2026-08-11 13:06:27.000000000 +0000
@@ -72,7 +72,7 @@
 /// "tau_min = 10s: tau < 10 => typed, never divided."
 inline constexpr std::int64_t kTauMinSeconds = 10;
 /// The innovation lag of channel 8.
-inline constexpr std::int64_t kDeltaLogBSeconds = 60;
+inline constexpr std::int64_t kDeltaLogBSeconds = 30;  // MX30
 
 // ---------------------------------------------------------------------------
 // The eight channels, in the pin's own order.
