engine/cpp/tests/mutants/MX31_wave2_priors_available_is_not_reported.patch
--- a/qr_wave2/src/prior_state.cpp	2026-08-11 13:04:14.000000000 +0000
+++ b/qr_wave2/src/prior_state.cpp	2026-08-11 13:04:14.000000000 +0000
@@ -99,7 +99,7 @@
     return view;
   }
   const std::size_t priors = source;
-  view.priors_available = static_cast<std::int64_t>(priors);
+  view.priors_available = 0;  // MX31: the warmup depth stops being reported
 
   const Entry& previous = entries_[source - 1U];
   if (previous.summary.grid_present) {
