engine/cpp/tests/mutants/MY01_w21_band_edge_becomes_left_open.patch
--- a/qr_w21/src/surface.cpp
+++ b/qr_w21/src/surface.cpp
@@ -161,7 +161,9 @@
   // exact edge falls in the band ABOVE it.
   std::size_t band = 0;
   for (const std::int64_t edge : kMoneynessEdgesBps) {
-    if (x_bps >= edge) {
+    // MY01: the band edge becomes LEFT-open, so a contract sitting exactly on
+    // an edge falls in the band below it instead of above.
+    if (x_bps > edge) {
       ++band;
     }
   }
