engine/cpp/tests/mutants/MY07_w21_bucket_moments_ignore_size.patch
--- a/qr_w21/src/surface.cpp
+++ b/qr_w21/src/surface.cpp
@@ -201,9 +201,11 @@
       ++out.two_sided;
       const std::int64_t mid = qr::sources::midpoint_u6(member.bid_u6, member.ask_u6);
       const auto spread = qr::carriers::displacement_bps(member.ask_u6 - member.bid_u6, mid);
+      // MY07: the size weight is dropped, so the bucket reports a plain
+      // unweighted mean spread.
       if (spread.has_value() && spread.value().v == Validity::VALID && weight > 0) {
-        spread_weight += weight;
-        spread_weighted_sum += weight * spread.value().value;
+        spread_weight += 1;
+        spread_weighted_sum += spread.value().value;
       }
     }
     if (weight > 0) {
