engine/cpp/tests/mutants/MY16_w21_quadratic_term_squares_the_u6_move.patch
--- a/qr_w21/src/surface.cpp
+++ b/qr_w21/src/surface.cpp
@@ -437,8 +437,11 @@
   // dollars before gamma squares it and the prediction is carried back to u6.
   // Squaring a u6 move against gamma would be wrong by 10^6.
   const double move_dollars = static_cast<double>(move_u6) / static_cast<double>(kU6PerUnit);
-  const double predicted_dollars = inputs.greeks.delta * move_dollars +
-                                   0.5 * inputs.greeks.gamma * move_dollars * move_dollars;
+  // MY16: the gamma term squares the U6 move instead of the dollar move, so
+  // the second-order prediction is wrong by 10^6.
+  const double predicted_dollars =
+      inputs.greeks.delta * move_dollars +
+      0.5 * inputs.greeks.gamma * static_cast<double>(move_u6) * static_cast<double>(move_u6);
   const double residual_u6 =
       static_cast<double>(observed_u6) - predicted_dollars * static_cast<double>(kU6PerUnit);
   // §W21-PIN-2: the denominator is the UNDERLYING mid at the span start.
