engine/cpp/tests/mutants/MY17_w21_reliability_weight_rounds_the_age_to_seconds.patch
--- a/qr_w21/src/surface.cpp
+++ b/qr_w21/src/surface.cpp
@@ -451,7 +451,9 @@
   // rho-oriented with sigma = +1; the SHORT reading is its negation.
   out.resid_bps = qr::carriers::present(static_cast<double>(inputs.rho) * bps);
   // Q7: w = exp(-age_greek_seconds/600), pinned.
-  out.weight = std::exp(-(static_cast<double>(age_ms) / 1000.0) / kReliabilityDecaySeconds);
+  // MY17: the greek age is truncated to whole seconds before Q7's decay, so a
+  // sub-second-old greek is weighted as if it were brand new.
+  out.weight = std::exp(-static_cast<double>(age_ms / 1000) / kReliabilityDecaySeconds);
   return out;
 }
 
