engine/cpp/tests/mutants/MZ01_scope_wall_unseals_the_sealed_2025_exam_zone.patch
--- a/qr_registry/src/day_scope.cpp
+++ b/qr_registry/src/day_scope.cpp
@@ -14,7 +14,8 @@
 Expected<DayScope, Refusal> DayScope::admit(const Registry& registry, std::int64_t ordinal) {
   // THE WALL, first statement of the function: nothing below runs for an
   // out-of-scope ordinal, and this function has no filesystem argument at all.
-  if (ordinal < kScopeFirstOrdinal || ordinal > kScopeLastOrdinal) {
+  if (ordinal < kScopeFirstOrdinal ||
+      ordinal >= static_cast<std::int64_t>(registry.size())) {
     return Expected<DayScope, Refusal>::refuse(
         Refusal(RefusalCode::ORDINAL_OUTSIDE_SCOPE, kSite,
                 "ordinal outside the scoped calendar 125..917", ordinal));
